aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
/**
 * \file
 *
 * \brief Component description for USART
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_USART_COMPONENT_
#define _SAM4L_USART_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR USART */
/* ========================================================================== */
/** \addtogroup SAM4L_USART Universal Synchronous Asynchronous Receiver Transmitter */
/*@{*/

#define REV_USART                   0x6021

/* -------- US_CR : (USART Offset: 0x00) ( /W 32) Control Register -------- */
#define US_CR_OFFSET                0x00         /**< \brief (US_CR offset) Control Register */

// LIN mode
#define US_CR_LIN_RSTRX_Pos         2            /**< \brief (US_CR_LIN) Reset Receiver */
#define US_CR_LIN_RSTRX             (0x1u << US_CR_LIN_RSTRX_Pos)
#define   US_CR_LIN_RSTRX_0         (0x0u <<  2) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RSTRX_1         (0x1u <<  2) /**< \brief (US_CR_LIN) Resets the receiver */
#define US_CR_LIN_RSTTX_Pos         3            /**< \brief (US_CR_LIN) Reset Transmitter */
#define US_CR_LIN_RSTTX             (0x1u << US_CR_LIN_RSTTX_Pos)
#define   US_CR_LIN_RSTTX_0         (0x0u <<  3) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RSTTX_1         (0x1u <<  3) /**< \brief (US_CR_LIN) Resets the transmitter */
#define US_CR_LIN_RXEN_Pos          4            /**< \brief (US_CR_LIN) Receiver Enable */
#define US_CR_LIN_RXEN              (0x1u << US_CR_LIN_RXEN_Pos)
#define   US_CR_LIN_RXEN_0          (0x0u <<  4) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RXEN_1          (0x1u <<  4) /**< \brief (US_CR_LIN) Enables the receiver, if RXDIS is 0 */
#define US_CR_LIN_RXDIS_Pos         5            /**< \brief (US_CR_LIN) Receiver Disable */
#define US_CR_LIN_RXDIS             (0x1u << US_CR_LIN_RXDIS_Pos)
#define   US_CR_LIN_RXDIS_0         (0x0u <<  5) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RXDIS_1         (0x1u <<  5) /**< \brief (US_CR_LIN) Disables the receiver */
#define US_CR_LIN_TXEN_Pos          6            /**< \brief (US_CR_LIN) Transmitter Enable */
#define US_CR_LIN_TXEN              (0x1u << US_CR_LIN_TXEN_Pos)
#define   US_CR_LIN_TXEN_0          (0x0u <<  6) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_TXEN_1          (0x1u <<  6) /**< \brief (US_CR_LIN) Enables the transmitter if TXDIS is 0 */
#define US_CR_LIN_TXDIS_Pos         7            /**< \brief (US_CR_LIN) Transmitter Disable */
#define US_CR_LIN_TXDIS             (0x1u << US_CR_LIN_TXDIS_Pos)
#define   US_CR_LIN_TXDIS_0         (0x0u <<  7) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_TXDIS_1         (0x1u <<  7) /**< \brief (US_CR_LIN) Disables the transmitter */
#define US_CR_LIN_RSTSTA_Pos        8            /**< \brief (US_CR_LIN) Reset Status Bits */
#define US_CR_LIN_RSTSTA            (0x1u << US_CR_LIN_RSTSTA_Pos)
#define   US_CR_LIN_RSTSTA_0        (0x0u <<  8) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RSTSTA_1        (0x1u <<  8) /**< \brief (US_CR_LIN) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_LIN_STTBRK_Pos        9            /**< \brief (US_CR_LIN) Start Break */
#define US_CR_LIN_STTBRK            (0x1u << US_CR_LIN_STTBRK_Pos)
#define   US_CR_LIN_STTBRK_0        (0x0u <<  9) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_STTBRK_1        (0x1u <<  9) /**< \brief (US_CR_LIN) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_LIN_STPBRK_Pos        10           /**< \brief (US_CR_LIN) Stop Break */
#define US_CR_LIN_STPBRK            (0x1u << US_CR_LIN_STPBRK_Pos)
#define   US_CR_LIN_STPBRK_0        (0x0u << 10) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_STPBRK_1        (0x1u << 10) /**< \brief (US_CR_LIN) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_LIN_STTTO_Pos         11           /**< \brief (US_CR_LIN) Start Time-out */
#define US_CR_LIN_STTTO             (0x1u << US_CR_LIN_STTTO_Pos)
#define   US_CR_LIN_STTTO_0         (0x0u << 11) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_STTTO_1         (0x1u << 11) /**< \brief (US_CR_LIN) Starts waiting for a character before clocking the time-out counter */
#define US_CR_LIN_SENDA_Pos         12           /**< \brief (US_CR_LIN) Send Address */
#define US_CR_LIN_SENDA             (0x1u << US_CR_LIN_SENDA_Pos)
#define   US_CR_LIN_SENDA_0         (0x0u << 12) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_SENDA_1         (0x1u << 12) /**< \brief (US_CR_LIN) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_LIN_RSTIT_Pos         13           /**< \brief (US_CR_LIN) Reset Iterations */
#define US_CR_LIN_RSTIT             (0x1u << US_CR_LIN_RSTIT_Pos)
#define   US_CR_LIN_RSTIT_0         (0x0u << 13) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RSTIT_1         (0x1u << 13) /**< \brief (US_CR_LIN) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_LIN_RSTNACK_Pos       14           /**< \brief (US_CR_LIN) Reset Non Acknowledge */
#define US_CR_LIN_RSTNACK           (0x1u << US_CR_LIN_RSTNACK_Pos)
#define   US_CR_LIN_RSTNACK_0       (0x0u << 14) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RSTNACK_1       (0x1u << 14) /**< \brief (US_CR_LIN) Resets NACK in CSR */
#define US_CR_LIN_RETTO_Pos         15           /**< \brief (US_CR_LIN) Rearm Time-out */
#define US_CR_LIN_RETTO             (0x1u << US_CR_LIN_RETTO_Pos)
#define   US_CR_LIN_RETTO_0         (0x0u << 15) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RETTO_1         (0x1u << 15) /**< \brief (US_CR_LIN) Restart Time-out */
#define US_CR_LIN_DTREN_Pos         16           /**< \brief (US_CR_LIN) Data Terminal Ready Enable */
#define US_CR_LIN_DTREN             (0x1u << US_CR_LIN_DTREN_Pos)
#define   US_CR_LIN_DTREN_0         (0x0u << 16) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_DTREN_1         (0x1u << 16) /**< \brief (US_CR_LIN) Drives the pin DTR at 0 */
#define US_CR_LIN_DTRDIS_Pos        17           /**< \brief (US_CR_LIN) Data Terminal Ready Disable */
#define US_CR_LIN_DTRDIS            (0x1u << US_CR_LIN_DTRDIS_Pos)
#define   US_CR_LIN_DTRDIS_0        (0x0u << 17) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_DTRDIS_1        (0x1u << 17) /**< \brief (US_CR_LIN) Drives the pin DTR to 1 */
#define US_CR_LIN_RTSEN_Pos         18           /**< \brief (US_CR_LIN) Request to Send Enable */
#define US_CR_LIN_RTSEN             (0x1u << US_CR_LIN_RTSEN_Pos)
#define   US_CR_LIN_RTSEN_0         (0x0u << 18) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RTSEN_1         (0x1u << 18) /**< \brief (US_CR_LIN) Drives the pin RTS to 0 */
#define US_CR_LIN_RTSDIS_Pos        19           /**< \brief (US_CR_LIN) Request to Send Disable */
#define US_CR_LIN_RTSDIS            (0x1u << US_CR_LIN_RTSDIS_Pos)
#define   US_CR_LIN_RTSDIS_0        (0x0u << 19) /**< \brief (US_CR_LIN) No effect */
#define   US_CR_LIN_RTSDIS_1        (0x1u << 19) /**< \brief (US_CR_LIN) Drives the pin RTS to 1 */
#define US_CR_LIN_LINABT_Pos        20           /**< \brief (US_CR_LIN) Abort the current LIN transmission */
#define US_CR_LIN_LINABT            (0x1u << US_CR_LIN_LINABT_Pos)
#define US_CR_LIN_LINWKUP_Pos       21           /**< \brief (US_CR_LIN) Sends a wakeup signal on the LIN bus */
#define US_CR_LIN_LINWKUP           (0x1u << US_CR_LIN_LINWKUP_Pos)
#define US_CR_LIN_MASK              0x003FFFFCu  /**< \brief (US_CR_LIN) MASK Register */

// SPI_MASTER mode
#define US_CR_SPI_MASTER_RSTRX_Pos  2            /**< \brief (US_CR_SPI_MASTER) Reset Receiver */
#define US_CR_SPI_MASTER_RSTRX      (0x1u << US_CR_SPI_MASTER_RSTRX_Pos)
#define   US_CR_SPI_MASTER_RSTRX_0  (0x0u <<  2) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTRX_1  (0x1u <<  2) /**< \brief (US_CR_SPI_MASTER) Resets the receiver */
#define US_CR_SPI_MASTER_RSTTX_Pos  3            /**< \brief (US_CR_SPI_MASTER) Reset Transmitter */
#define US_CR_SPI_MASTER_RSTTX      (0x1u << US_CR_SPI_MASTER_RSTTX_Pos)
#define   US_CR_SPI_MASTER_RSTTX_0  (0x0u <<  3) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTTX_1  (0x1u <<  3) /**< \brief (US_CR_SPI_MASTER) Resets the transmitter */
#define US_CR_SPI_MASTER_RXEN_Pos   4            /**< \brief (US_CR_SPI_MASTER) Receiver Enable */
#define US_CR_SPI_MASTER_RXEN       (0x1u << US_CR_SPI_MASTER_RXEN_Pos)
#define   US_CR_SPI_MASTER_RXEN_0   (0x0u <<  4) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RXEN_1   (0x1u <<  4) /**< \brief (US_CR_SPI_MASTER) Enables the receiver, if RXDIS is 0 */
#define US_CR_SPI_MASTER_RXDIS_Pos  5            /**< \brief (US_CR_SPI_MASTER) Receiver Disable */
#define US_CR_SPI_MASTER_RXDIS      (0x1u << US_CR_SPI_MASTER_RXDIS_Pos)
#define   US_CR_SPI_MASTER_RXDIS_0  (0x0u <<  5) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RXDIS_1  (0x1u <<  5) /**< \brief (US_CR_SPI_MASTER) Disables the receiver */
#define US_CR_SPI_MASTER_TXEN_Pos   6            /**< \brief (US_CR_SPI_MASTER) Transmitter Enable */
#define US_CR_SPI_MASTER_TXEN       (0x1u << US_CR_SPI_MASTER_TXEN_Pos)
#define   US_CR_SPI_MASTER_TXEN_0   (0x0u <<  6) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_TXEN_1   (0x1u <<  6) /**< \brief (US_CR_SPI_MASTER) Enables the transmitter if TXDIS is 0 */
#define US_CR_SPI_MASTER_TXDIS_Pos  7            /**< \brief (US_CR_SPI_MASTER) Transmitter Disable */
#define US_CR_SPI_MASTER_TXDIS      (0x1u << US_CR_SPI_MASTER_TXDIS_Pos)
#define   US_CR_SPI_MASTER_TXDIS_0  (0x0u <<  7) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_TXDIS_1  (0x1u <<  7) /**< \brief (US_CR_SPI_MASTER) Disables the transmitter */
#define US_CR_SPI_MASTER_RSTSTA_Pos 8            /**< \brief (US_CR_SPI_MASTER) Reset Status Bits */
#define US_CR_SPI_MASTER_RSTSTA     (0x1u << US_CR_SPI_MASTER_RSTSTA_Pos)
#define   US_CR_SPI_MASTER_RSTSTA_0 (0x0u <<  8) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTSTA_1 (0x1u <<  8) /**< \brief (US_CR_SPI_MASTER) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_SPI_MASTER_STTBRK_Pos 9            /**< \brief (US_CR_SPI_MASTER) Start Break */
#define US_CR_SPI_MASTER_STTBRK     (0x1u << US_CR_SPI_MASTER_STTBRK_Pos)
#define   US_CR_SPI_MASTER_STTBRK_0 (0x0u <<  9) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_STTBRK_1 (0x1u <<  9) /**< \brief (US_CR_SPI_MASTER) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_SPI_MASTER_STPBRK_Pos 10           /**< \brief (US_CR_SPI_MASTER) Stop Break */
#define US_CR_SPI_MASTER_STPBRK     (0x1u << US_CR_SPI_MASTER_STPBRK_Pos)
#define   US_CR_SPI_MASTER_STPBRK_0 (0x0u << 10) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_STPBRK_1 (0x1u << 10) /**< \brief (US_CR_SPI_MASTER) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_SPI_MASTER_STTTO_Pos  11           /**< \brief (US_CR_SPI_MASTER) Start Time-out */
#define US_CR_SPI_MASTER_STTTO      (0x1u << US_CR_SPI_MASTER_STTTO_Pos)
#define   US_CR_SPI_MASTER_STTTO_0  (0x0u << 11) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_STTTO_1  (0x1u << 11) /**< \brief (US_CR_SPI_MASTER) Starts waiting for a character before clocking the time-out counter */
#define US_CR_SPI_MASTER_SENDA_Pos  12           /**< \brief (US_CR_SPI_MASTER) Send Address */
#define US_CR_SPI_MASTER_SENDA      (0x1u << US_CR_SPI_MASTER_SENDA_Pos)
#define   US_CR_SPI_MASTER_SENDA_0  (0x0u << 12) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_SENDA_1  (0x1u << 12) /**< \brief (US_CR_SPI_MASTER) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_SPI_MASTER_RSTIT_Pos  13           /**< \brief (US_CR_SPI_MASTER) Reset Iterations */
#define US_CR_SPI_MASTER_RSTIT      (0x1u << US_CR_SPI_MASTER_RSTIT_Pos)
#define   US_CR_SPI_MASTER_RSTIT_0  (0x0u << 13) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTIT_1  (0x1u << 13) /**< \brief (US_CR_SPI_MASTER) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_SPI_MASTER_RSTNACK_Pos 14           /**< \brief (US_CR_SPI_MASTER) Reset Non Acknowledge */
#define US_CR_SPI_MASTER_RSTNACK    (0x1u << US_CR_SPI_MASTER_RSTNACK_Pos)
#define   US_CR_SPI_MASTER_RSTNACK_0 (0x0u << 14) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTNACK_1 (0x1u << 14) /**< \brief (US_CR_SPI_MASTER) Resets NACK in CSR */
#define US_CR_SPI_MASTER_RETTO_Pos  15           /**< \brief (US_CR_SPI_MASTER) Rearm Time-out */
#define US_CR_SPI_MASTER_RETTO      (0x1u << US_CR_SPI_MASTER_RETTO_Pos)
#define   US_CR_SPI_MASTER_RETTO_0  (0x0u << 15) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RETTO_1  (0x1u << 15) /**< \brief (US_CR_SPI_MASTER) Restart Time-out */
#define US_CR_SPI_MASTER_DTREN_Pos  16           /**< \brief (US_CR_SPI_MASTER) Data Terminal Ready Enable */
#define US_CR_SPI_MASTER_DTREN      (0x1u << US_CR_SPI_MASTER_DTREN_Pos)
#define   US_CR_SPI_MASTER_DTREN_0  (0x0u << 16) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_DTREN_1  (0x1u << 16) /**< \brief (US_CR_SPI_MASTER) Drives the pin DTR at 0 */
#define US_CR_SPI_MASTER_DTRDIS_Pos 17           /**< \brief (US_CR_SPI_MASTER) Data Terminal Ready Disable */
#define US_CR_SPI_MASTER_DTRDIS     (0x1u << US_CR_SPI_MASTER_DTRDIS_Pos)
#define   US_CR_SPI_MASTER_DTRDIS_0 (0x0u << 17) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_DTRDIS_1 (0x1u << 17) /**< \brief (US_CR_SPI_MASTER) Drives the pin DTR to 1 */
#define US_CR_SPI_MASTER_FCS_Pos    18           /**< \brief (US_CR_SPI_MASTER) Force SPI Chip Select */
#define US_CR_SPI_MASTER_FCS        (0x1u << US_CR_SPI_MASTER_FCS_Pos)
#define   US_CR_SPI_MASTER_FCS_0    (0x0u << 18) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_FCS_1    (0x1u << 18) /**< \brief (US_CR_SPI_MASTER) Forces the Slave Select Line NSS (RTS pin) to 0, even if USART is no transmitting, in order to address SPI slave devices supporting the CSAAT Mode (Chip Select Active After Transfer) */
#define US_CR_SPI_MASTER_RCS_Pos    19           /**< \brief (US_CR_SPI_MASTER) Release SPI Chip Select */
#define US_CR_SPI_MASTER_RCS        (0x1u << US_CR_SPI_MASTER_RCS_Pos)
#define   US_CR_SPI_MASTER_RCS_0    (0x0u << 19) /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RCS_1    (0x1u << 19) /**< \brief (US_CR_SPI_MASTER) Releases the Slave Select Line NSS (RTS pin) */
#define US_CR_SPI_MASTER_MASK       0x000FFFFCu  /**< \brief (US_CR_SPI_MASTER) MASK Register */

