aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
// USART mode
#define US_CR_USART_RSTRX_Pos       2            /**< \brief (US_CR_USART) Reset Receiver */
#define US_CR_USART_RSTRX           (0x1u << US_CR_USART_RSTRX_Pos)
#define   US_CR_USART_RSTRX_0       (0x0u <<  2) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTRX_1       (0x1u <<  2) /**< \brief (US_CR_USART) Resets the receiver */
#define US_CR_USART_RSTTX_Pos       3            /**< \brief (US_CR_USART) Reset Transmitter */
#define US_CR_USART_RSTTX           (0x1u << US_CR_USART_RSTTX_Pos)
#define   US_CR_USART_RSTTX_0       (0x0u <<  3) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTTX_1       (0x1u <<  3) /**< \brief (US_CR_USART) Resets the transmitter */
#define US_CR_USART_RXEN_Pos        4            /**< \brief (US_CR_USART) Receiver Enable */
#define US_CR_USART_RXEN            (0x1u << US_CR_USART_RXEN_Pos)
#define   US_CR_USART_RXEN_0        (0x0u <<  4) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RXEN_1        (0x1u <<  4) /**< \brief (US_CR_USART) Enables the receiver, if RXDIS is 0 */
#define US_CR_USART_RXDIS_Pos       5            /**< \brief (US_CR_USART) Receiver Disable */
#define US_CR_USART_RXDIS           (0x1u << US_CR_USART_RXDIS_Pos)
#define   US_CR_USART_RXDIS_0       (0x0u <<  5) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RXDIS_1       (0x1u <<  5) /**< \brief (US_CR_USART) Disables the receiver */
#define US_CR_USART_TXEN_Pos        6            /**< \brief (US_CR_USART) Transmitter Enable */
#define US_CR_USART_TXEN            (0x1u << US_CR_USART_TXEN_Pos)
#define   US_CR_USART_TXEN_0        (0x0u <<  6) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_TXEN_1        (0x1u <<  6) /**< \brief (US_CR_USART) Enables the transmitter if TXDIS is 0 */
#define US_CR_USART_TXDIS_Pos       7            /**< \brief (US_CR_USART) Transmitter Disable */
#define US_CR_USART_TXDIS           (0x1u << US_CR_USART_TXDIS_Pos)
#define   US_CR_USART_TXDIS_0       (0x0u <<  7) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_TXDIS_1       (0x1u <<  7) /**< \brief (US_CR_USART) Disables the transmitter */
#define US_CR_USART_RSTSTA_Pos      8            /**< \brief (US_CR_USART) Reset Status Bits */
#define US_CR_USART_RSTSTA          (0x1u << US_CR_USART_RSTSTA_Pos)
#define   US_CR_USART_RSTSTA_0      (0x0u <<  8) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTSTA_1      (0x1u <<  8) /**< \brief (US_CR_USART) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_USART_STTBRK_Pos      9            /**< \brief (US_CR_USART) Start Break */
#define US_CR_USART_STTBRK          (0x1u << US_CR_USART_STTBRK_Pos)
#define   US_CR_USART_STTBRK_0      (0x0u <<  9) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_STTBRK_1      (0x1u <<  9) /**< \brief (US_CR_USART) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_USART_STPBRK_Pos      10           /**< \brief (US_CR_USART) Stop Break */
#define US_CR_USART_STPBRK          (0x1u << US_CR_USART_STPBRK_Pos)
#define   US_CR_USART_STPBRK_0      (0x0u << 10) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_STPBRK_1      (0x1u << 10) /**< \brief (US_CR_USART) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_USART_STTTO_Pos       11           /**< \brief (US_CR_USART) Start Time-out */
#define US_CR_USART_STTTO           (0x1u << US_CR_USART_STTTO_Pos)
#define   US_CR_USART_STTTO_0       (0x0u << 11) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_STTTO_1       (0x1u << 11) /**< \brief (US_CR_USART) Starts waiting for a character before clocking the time-out counter */
#define US_CR_USART_SENDA_Pos       12           /**< \brief (US_CR_USART) Send Address */
#define US_CR_USART_SENDA           (0x1u << US_CR_USART_SENDA_Pos)
#define   US_CR_USART_SENDA_0       (0x0u << 12) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_SENDA_1       (0x1u << 12) /**< \brief (US_CR_USART) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_USART_RSTIT_Pos       13           /**< \brief (US_CR_USART) Reset Iterations */
#define US_CR_USART_RSTIT           (0x1u << US_CR_USART_RSTIT_Pos)
#define   US_CR_USART_RSTIT_0       (0x0u << 13) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTIT_1       (0x1u << 13) /**< \brief (US_CR_USART) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_USART_RSTNACK_Pos     14           /**< \brief (US_CR_USART) Reset Non Acknowledge */
#define US_CR_USART_RSTNACK         (0x1u << US_CR_USART_RSTNACK_Pos)
#define   US_CR_USART_RSTNACK_0     (0x0u << 14) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTNACK_1     (0x1u << 14) /**< \brief (US_CR_USART) Resets NACK in CSR */
#define US_CR_USART_RETTO_Pos       15           /**< \brief (US_CR_USART) Rearm Time-out */
#define US_CR_USART_RETTO           (0x1u << US_CR_USART_RETTO_Pos)
#define   US_CR_USART_RETTO_0       (0x0u << 15) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RETTO_1       (0x1u << 15) /**< \brief (US_CR_USART) Restart Time-out */
#define US_CR_USART_DTREN_Pos       16           /**< \brief (US_CR_USART) Data Terminal Ready Enable */
#define US_CR_USART_DTREN           (0x1u << US_CR_USART_DTREN_Pos)
#define   US_CR_USART_DTREN_0       (0x0u << 16) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_DTREN_1       (0x1u << 16) /**< \brief (US_CR_USART) Drives the pin DTR at 0 */
#define US_CR_USART_DTRDIS_Pos      17           /**< \brief (US_CR_USART) Data Terminal Ready Disable */
#define US_CR_USART_DTRDIS          (0x1u << US_CR_USART_DTRDIS_Pos)
#define   US_CR_USART_DTRDIS_0      (0x0u << 17) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_DTRDIS_1      (0x1u << 17) /**< \brief (US_CR_USART) Drives the pin DTR to 1 */
#define US_CR_USART_RTSEN_Pos       18           /**< \brief (US_CR_USART) Request to Send Enable */
#define US_CR_USART_RTSEN           (0x1u << US_CR_USART_RTSEN_Pos)
#define   US_CR_USART_RTSEN_0       (0x0u << 18) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RTSEN_1       (0x1u << 18) /**< \brief (US_CR_USART) Drives the pin RTS to 0 */
#define US_CR_USART_RTSDIS_Pos      19           /**< \brief (US_CR_USART) Request to Send Disable */
#define US_CR_USART_RTSDIS          (0x1u << US_CR_USART_RTSDIS_Pos)
#define   US_CR_USART_RTSDIS_0      (0x0u << 19) /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RTSDIS_1      (0x1u << 19) /**< \brief (US_CR_USART) Drives the pin RTS to 1 */
#define US_CR_USART_MASK            0x000FFFFCu  /**< \brief (US_CR_USART) MASK Register */

// Any mode
#define US_CR_RSTRX_Pos             2            /**< \brief (US_CR) Reset Receiver */
#define US_CR_RSTRX                 (0x1u << US_CR_RSTRX_Pos)
#define   US_CR_RSTRX_0             (0x0u <<  2) /**< \brief (US_CR) No effect */
#define   US_CR_RSTRX_1             (0x1u <<  2) /**< \brief (US_CR) Resets the receiver */
#define US_CR_RSTTX_Pos             3            /**< \brief (US_CR) Reset Transmitter */
#define US_CR_RSTTX                 (0x1u << US_CR_RSTTX_Pos)
#define   US_CR_RSTTX_0             (0x0u <<  3) /**< \brief (US_CR) No effect */
#define   US_CR_RSTTX_1             (0x1u <<  3) /**< \brief (US_CR) Resets the transmitter */
#define US_CR_RXEN_Pos              4            /**< \brief (US_CR) Receiver Enable */
#define US_CR_RXEN                  (0x1u << US_CR_RXEN_Pos)
#define   US_CR_RXEN_0              (0x0u <<  4) /**< \brief (US_CR) No effect */
#define   US_CR_RXEN_1              (0x1u <<  4) /**< \brief (US_CR) Enables the receiver, if RXDIS is 0 */
#define US_CR_RXDIS_Pos             5            /**< \brief (US_CR) Receiver Disable */
#define US_CR_RXDIS                 (0x1u << US_CR_RXDIS_Pos)
#define   US_CR_RXDIS_0             (0x0u <<  5) /**< \brief (US_CR) No effect */
#define   US_CR_RXDIS_1             (0x1u <<  5) /**< \brief (US_CR) Disables the receiver */
#define US_CR_TXEN_Pos              6            /**< \brief (US_CR) Transmitter Enable */
#define US_CR_TXEN                  (0x1u << US_CR_TXEN_Pos)
#define   US_CR_TXEN_0              (0x0u <<  6) /**< \brief (US_CR) No effect */
#define   US_CR_TXEN_1              (0x1u <<  6) /**< \brief (US_CR) Enables the transmitter if TXDIS is 0 */
#define US_CR_TXDIS_Pos             7            /**< \brief (US_CR) Transmitter Disable */
#define US_CR_TXDIS                 (0x1u << US_CR_TXDIS_Pos)
#define   US_CR_TXDIS_0             (0x0u <<  7) /**< \brief (US_CR) No effect */
#define   US_CR_TXDIS_1             (0x1u <<  7) /**< \brief (US_CR) Disables the transmitter */
#define US_CR_RSTSTA_Pos            8            /**< \brief (US_CR) Reset Status Bits */
#define US_CR_RSTSTA                (0x1u << US_CR_RSTSTA_Pos)
#define   US_CR_RSTSTA_0            (0x0u <<  8) /**< \brief (US_CR) No effect */
#define   US_CR_RSTSTA_1            (0x1u <<  8) /**< \brief (US_CR) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_STTBRK_Pos            9            /**< \brief (US_CR) Start Break */
#define US_CR_STTBRK                (0x1u << US_CR_STTBRK_Pos)
#define   US_CR_STTBRK_0            (0x0u <<  9) /**< \brief (US_CR) No effect */
#define   US_CR_STTBRK_1            (0x1u <<  9) /**< \brief (US_CR) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_STPBRK_Pos            10           /**< \brief (US_CR) Stop Break */
#define US_CR_STPBRK                (0x1u << US_CR_STPBRK_Pos)
#define   US_CR_STPBRK_0            (0x0u << 10) /**< \brief (US_CR) No effect */
#define   US_CR_STPBRK_1            (0x1u << 10) /**< \brief (US_CR) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_STTTO_Pos             11           /**< \brief (US_CR) Start Time-out */
#define US_CR_STTTO                 (0x1u << US_CR_STTTO_Pos)
#define   US_CR_STTTO_0             (0x0u << 11) /**< \brief (US_CR) No effect */
#define   US_CR_STTTO_1             (0x1u << 11) /**< \brief (US_CR) Starts waiting for a character before clocking the time-out counter */
#define US_CR_SENDA_Pos             12           /**< \brief (US_CR) Send Address */
#define US_CR_SENDA                 (0x1u << US_CR_SENDA_Pos)
#define   US_CR_SENDA_0             (0x0u << 12) /**< \brief (US_CR) No effect */
#define   US_CR_SENDA_1             (0x1u << 12) /**< \brief (US_CR) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_RSTIT_Pos             13           /**< \brief (US_CR) Reset Iterations */
#define US_CR_RSTIT                 (0x1u << US_CR_RSTIT_Pos)
#define   US_CR_RSTIT_0             (0x0u << 13) /**< \brief (US_CR) No effect */
#define   US_CR_RSTIT_1             (0x1u << 13) /**< \brief (US_CR) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_RSTNACK_Pos           14           /**< \brief (US_CR) Reset Non Acknowledge */
#define US_CR_RSTNACK               (0x1u << US_CR_RSTNACK_Pos)
#define   US_CR_RSTNACK_0           (0x0u << 14) /**< \brief (US_CR) No effect */
#define   US_CR_RSTNACK_1           (0x1u << 14) /**< \brief (US_CR) Resets NACK in CSR */
#define US_CR_RETTO_Pos             15           /**< \brief (US_CR) Rearm Time-out */
#define US_CR_RETTO                 (0x1u << US_CR_RETTO_Pos)
#define   US_CR_RETTO_0             (0x0u << 15) /**< \brief (US_CR) No effect */
#define   US_CR_RETTO_1             (0x1u << 15) /**< \brief (US_CR) Restart Time-out */
#define US_CR_DTREN_Pos             16           /**< \brief (US_CR) Data Terminal Ready Enable */
#define US_CR_DTREN                 (0x1u << US_CR_DTREN_Pos)
#define   US_CR_DTREN_0             (0x0u << 16) /**< \brief (US_CR) No effect */
#define   US_CR_DTREN_1             (0x1u << 16) /**< \brief (US_CR) Drives the pin DTR at 0 */
#define US_CR_DTRDIS_Pos            17           /**< \brief (US_CR) Data Terminal Ready Disable */
#define US_CR_DTRDIS                (0x1u << US_CR_DTRDIS_Pos)
#define   US_CR_DTRDIS_0            (0x0u << 17) /**< \brief (US_CR) No effect */
#define   US_CR_DTRDIS_1            (0x1u << 17) /**< \brief (US_CR) Drives the pin DTR to 1 */
#define US_CR_RTSEN_Pos             18           /**< \brief (US_CR) Request to Send Enable */
#define US_CR_RTSEN                 (0x1u << US_CR_RTSEN_Pos)
#define   US_CR_RTSEN_0             (0x0u << 18) /**< \brief (US_CR) No effect */
#define   US_CR_RTSEN_1             (0x1u << 18) /**< \brief (US_CR) Drives the pin RTS to 0 */
#define US_CR_FCS_Pos               18           /**< \brief (US_CR) Force SPI Chip Select */
#define US_CR_FCS                   (0x1u << US_CR_FCS_Pos)
#define   US_CR_FCS_0               (0x0u << 18) /**< \brief (US_CR) No effect */
#define   US_CR_FCS_1               (0x1u << 18) /**< \brief (US_CR) Forces the Slave Select Line NSS (RTS pin) to 0, even if USART is no transmitting, in order to address SPI slave devices supporting the CSAAT Mode (Chip Select Active After Transfer) */
#define US_CR_RTSEN_Pos             18           /**< \brief (US_CR) Request to Send Enable */
#define US_CR_RTSEN                 (0x1u << US_CR_RTSEN_Pos)
#define   US_CR_RTSEN_0             (0x0u << 18) /**< \brief (US_CR) No effect */
#define   US_CR_RTSEN_1             (0x1u << 18) /**< \brief (US_CR) Drives the pin RTS to 0 */
#define US_CR_RTSDIS_Pos            19           /**< \brief (US_CR) Request to Send Disable */
#define US_CR_RTSDIS                (0x1u << US_CR_RTSDIS_Pos)
#define   US_CR_RTSDIS_0            (0x0u << 19) /**< \brief (US_CR) No effect */
#define   US_CR_RTSDIS_1            (0x1u << 19) /**< \brief (US_CR) Drives the pin RTS to 1 */
#define US_CR_RCS_Pos               19           /**< \brief (US_CR) Release SPI Chip Select */
#define US_CR_RCS                   (0x1u << US_CR_RCS_Pos)
#define   US_CR_RCS_0               (0x0u << 19) /**< \brief (US_CR) No effect */
#define   US_CR_RCS_1               (0x1u << 19) /**< \brief (US_CR) Releases the Slave Select Line NSS (RTS pin) */
#define US_CR_RTSDIS_Pos            19           /**< \brief (US_CR) Request to Send Disable */
#define US_CR_RTSDIS                (0x1u << US_CR_RTSDIS_Pos)
#define   US_CR_RTSDIS_0            (0x0u << 19) /**< \brief (US_CR) No effect */
#define   US_CR_RTSDIS_1            (0x1u << 19) /**< \brief (US_CR) Drives the pin RTS to 1 */
#define US_CR_LINABT_Pos            20           /**< \brief (US_CR) Abort the current LIN transmission */
#define US_CR_LINABT                (0x1u << US_CR_LINABT_Pos)
#define US_CR_LINWKUP_Pos           21           /**< \brief (US_CR) Sends a wakeup signal on the LIN bus */
#define US_CR_LINWKUP               (0x1u << US_CR_LINWKUP_Pos)
#define US_CR_MASK                  0x003FFFFCu  /**< \brief (US_CR) MASK Register */

/* -------- US_MR : (USART Offset: 0x04) (R/W 32) Mode Register -------- */
#define US_MR_OFFSET                0x04         /**< \brief (US_MR offset) Mode Register */
#define US_MR_RESETVALUE            0x00000000   /**< \brief (US_MR reset_value) Mode Register */

