aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
// USART mode
#define US_IER_USART_RXRDY_Pos      0            /**< \brief (US_IER_USART) Receiver Ready Interrupt Enable */
#define US_IER_USART_RXRDY          (0x1u << US_IER_USART_RXRDY_Pos)
#define   US_IER_USART_RXRDY_0      (0x0u <<  0) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RXRDY_1      (0x1u <<  0) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TXRDY_Pos      1            /**< \brief (US_IER_USART) Transmitter Ready Interrupt Enable */
#define US_IER_USART_TXRDY          (0x1u << US_IER_USART_TXRDY_Pos)
#define   US_IER_USART_TXRDY_0      (0x0u <<  1) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TXRDY_1      (0x1u <<  1) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RXBRK_Pos      2            /**< \brief (US_IER_USART) Receiver Break Interrupt Enable */
#define US_IER_USART_RXBRK          (0x1u << US_IER_USART_RXBRK_Pos)
#define   US_IER_USART_RXBRK_0      (0x0u <<  2) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RXBRK_1      (0x1u <<  2) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_ENDRX_Pos      3            /**< \brief (US_IER_USART) End of Receive Transfer Interrupt Enable */
#define US_IER_USART_ENDRX          (0x1u << US_IER_USART_ENDRX_Pos)
#define   US_IER_USART_ENDRX_0      (0x0u <<  3) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_ENDRX_1      (0x1u <<  3) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_ENDTX_Pos      4            /**< \brief (US_IER_USART) End of Transmit Interrupt Enable */
#define US_IER_USART_ENDTX          (0x1u << US_IER_USART_ENDTX_Pos)
#define   US_IER_USART_ENDTX_0      (0x0u <<  4) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_ENDTX_1      (0x1u <<  4) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_OVRE_Pos       5            /**< \brief (US_IER_USART) Overrun Error Interrupt Enable */
#define US_IER_USART_OVRE           (0x1u << US_IER_USART_OVRE_Pos)
#define   US_IER_USART_OVRE_0       (0x0u <<  5) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_OVRE_1       (0x1u <<  5) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_FRAME_Pos      6            /**< \brief (US_IER_USART) Framing Error Interrupt Enable */
#define US_IER_USART_FRAME          (0x1u << US_IER_USART_FRAME_Pos)
#define   US_IER_USART_FRAME_0      (0x0u <<  6) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_FRAME_1      (0x1u <<  6) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_PARE_Pos       7            /**< \brief (US_IER_USART) Parity Error Interrupt Enable */
#define US_IER_USART_PARE           (0x1u << US_IER_USART_PARE_Pos)
#define   US_IER_USART_PARE_0       (0x0u <<  7) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_PARE_1       (0x1u <<  7) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TIMEOUT_Pos    8            /**< \brief (US_IER_USART) Time-out Interrupt Enable */
#define US_IER_USART_TIMEOUT        (0x1u << US_IER_USART_TIMEOUT_Pos)
#define   US_IER_USART_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TXEMPTY_Pos    9            /**< \brief (US_IER_USART) Transmitter Empty Interrupt Enable */
#define US_IER_USART_TXEMPTY        (0x1u << US_IER_USART_TXEMPTY_Pos)
#define   US_IER_USART_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_ITER_Pos       10           /**< \brief (US_IER_USART) Iteration Interrupt Enable */
#define US_IER_USART_ITER           (0x1u << US_IER_USART_ITER_Pos)
#define   US_IER_USART_ITER_0       (0x0u << 10) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_ITER_1       (0x1u << 10) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TXBUFE_Pos     11           /**< \brief (US_IER_USART) Buffer Empty Interrupt Enable */
#define US_IER_USART_TXBUFE         (0x1u << US_IER_USART_TXBUFE_Pos)
#define   US_IER_USART_TXBUFE_0     (0x0u << 11) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TXBUFE_1     (0x1u << 11) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RXBUFF_Pos     12           /**< \brief (US_IER_USART) Buffer Full Interrupt Enable */
#define US_IER_USART_RXBUFF         (0x1u << US_IER_USART_RXBUFF_Pos)
#define   US_IER_USART_RXBUFF_0     (0x0u << 12) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RXBUFF_1     (0x1u << 12) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_NACK_Pos       13           /**< \brief (US_IER_USART) Non Acknowledge Interrupt Enable */
#define US_IER_USART_NACK           (0x1u << US_IER_USART_NACK_Pos)
#define   US_IER_USART_NACK_0       (0x0u << 13) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_NACK_1       (0x1u << 13) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RIIC_Pos       16           /**< \brief (US_IER_USART) Ring Indicator Input Change Enable */
#define US_IER_USART_RIIC           (0x1u << US_IER_USART_RIIC_Pos)
#define   US_IER_USART_RIIC_0       (0x0u << 16) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RIIC_1       (0x1u << 16) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_DSRIC_Pos      17           /**< \brief (US_IER_USART) Data Set Ready Input Change Enable */
#define US_IER_USART_DSRIC          (0x1u << US_IER_USART_DSRIC_Pos)
#define   US_IER_USART_DSRIC_0      (0x0u << 17) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_DSRIC_1      (0x1u << 17) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_DCDIC_Pos      18           /**< \brief (US_IER_USART) Data Carrier Detect Input Change Interrupt Enable */
#define US_IER_USART_DCDIC          (0x1u << US_IER_USART_DCDIC_Pos)
#define   US_IER_USART_DCDIC_0      (0x0u << 18) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_DCDIC_1      (0x1u << 18) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_CTSIC_Pos      19           /**< \brief (US_IER_USART) Clear to Send Input Change Interrupt Enable */
#define US_IER_USART_CTSIC          (0x1u << US_IER_USART_CTSIC_Pos)
#define   US_IER_USART_CTSIC_0      (0x0u << 19) /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_CTSIC_1      (0x1u << 19) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_MANE_Pos       20           /**< \brief (US_IER_USART) Manchester Error Interrupt Enable */
#define US_IER_USART_MANE           (0x1u << US_IER_USART_MANE_Pos)
#define US_IER_USART_MANEA_Pos      24           /**< \brief (US_IER_USART) Manchester Error Interrupt Enable */
#define US_IER_USART_MANEA          (0x1u << US_IER_USART_MANEA_Pos)
#define   US_IER_USART_MANEA_0      (0x0u << 24) /**< \brief (US_IER_USART) No effect */
#define   US_IER_USART_MANEA_1      (0x1u << 24) /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_MASK           0x011F3FFFu  /**< \brief (US_IER_USART) MASK Register */

// Any mode
#define US_IER_RXRDY_Pos            0            /**< \brief (US_IER) Receiver Ready Interrupt Enable */
#define US_IER_RXRDY                (0x1u << US_IER_RXRDY_Pos)
#define   US_IER_RXRDY_0            (0x0u <<  0) /**< \brief (US_IER) No Effect */
#define   US_IER_RXRDY_1            (0x1u <<  0) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TXRDY_Pos            1            /**< \brief (US_IER) Transmitter Ready Interrupt Enable */
#define US_IER_TXRDY                (0x1u << US_IER_TXRDY_Pos)
#define   US_IER_TXRDY_0            (0x0u <<  1) /**< \brief (US_IER) No Effect */
#define   US_IER_TXRDY_1            (0x1u <<  1) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_RXBRK_Pos            2            /**< \brief (US_IER) Receiver Break Interrupt Enable */
#define US_IER_RXBRK                (0x1u << US_IER_RXBRK_Pos)
#define   US_IER_RXBRK_0            (0x0u <<  2) /**< \brief (US_IER) No Effect */
#define   US_IER_RXBRK_1            (0x1u <<  2) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_ENDRX_Pos            3            /**< \brief (US_IER) End of Receive Transfer Interrupt Enable */
#define US_IER_ENDRX                (0x1u << US_IER_ENDRX_Pos)
#define   US_IER_ENDRX_0            (0x0u <<  3) /**< \brief (US_IER) No Effect */
#define   US_IER_ENDRX_1            (0x1u <<  3) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_ENDTX_Pos            4            /**< \brief (US_IER) End of Transmit Interrupt Enable */
#define US_IER_ENDTX                (0x1u << US_IER_ENDTX_Pos)
#define   US_IER_ENDTX_0            (0x0u <<  4) /**< \brief (US_IER) No Effect */
#define   US_IER_ENDTX_1            (0x1u <<  4) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_OVRE_Pos             5            /**< \brief (US_IER) Overrun Error Interrupt Enable */
#define US_IER_OVRE                 (0x1u << US_IER_OVRE_Pos)
#define   US_IER_OVRE_0             (0x0u <<  5) /**< \brief (US_IER) No Effect */
#define   US_IER_OVRE_1             (0x1u <<  5) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_FRAME_Pos            6            /**< \brief (US_IER) Framing Error Interrupt Enable */
#define US_IER_FRAME                (0x1u << US_IER_FRAME_Pos)
#define   US_IER_FRAME_0            (0x0u <<  6) /**< \brief (US_IER) No Effect */
#define   US_IER_FRAME_1            (0x1u <<  6) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_PARE_Pos             7            /**< \brief (US_IER) Parity Error Interrupt Enable */
#define US_IER_PARE                 (0x1u << US_IER_PARE_Pos)
#define   US_IER_PARE_0             (0x0u <<  7) /**< \brief (US_IER) No Effect */
#define   US_IER_PARE_1             (0x1u <<  7) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TIMEOUT_Pos          8            /**< \brief (US_IER) Time-out Interrupt Enable */
#define US_IER_TIMEOUT              (0x1u << US_IER_TIMEOUT_Pos)
#define   US_IER_TIMEOUT_0          (0x0u <<  8) /**< \brief (US_IER) No Effect */
#define   US_IER_TIMEOUT_1          (0x1u <<  8) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TXEMPTY_Pos          9            /**< \brief (US_IER) Transmitter Empty Interrupt Enable */
#define US_IER_TXEMPTY              (0x1u << US_IER_TXEMPTY_Pos)
#define   US_IER_TXEMPTY_0          (0x0u <<  9) /**< \brief (US_IER) No Effect */
#define   US_IER_TXEMPTY_1          (0x1u <<  9) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_ITER_Pos             10           /**< \brief (US_IER) Iteration Interrupt Enable */
#define US_IER_ITER                 (0x1u << US_IER_ITER_Pos)
#define   US_IER_ITER_0             (0x0u << 10) /**< \brief (US_IER) No Effect */
#define   US_IER_ITER_1             (0x1u << 10) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_UNRE_Pos             10           /**< \brief (US_IER) SPI Underrun Error Interrupt Enable */
#define US_IER_UNRE                 (0x1u << US_IER_UNRE_Pos)
#define   US_IER_UNRE_0             (0x0u << 10) /**< \brief (US_IER) No Effect */
#define   US_IER_UNRE_1             (0x1u << 10) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_ITER_Pos             10           /**< \brief (US_IER) Iteration Interrupt Enable */
#define US_IER_ITER                 (0x1u << US_IER_ITER_Pos)
#define   US_IER_ITER_0             (0x0u << 10) /**< \brief (US_IER) No Effect */
#define   US_IER_ITER_1             (0x1u << 10) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TXBUFE_Pos           11           /**< \brief (US_IER) Buffer Empty Interrupt Enable */
#define US_IER_TXBUFE               (0x1u << US_IER_TXBUFE_Pos)
#define   US_IER_TXBUFE_0           (0x0u << 11) /**< \brief (US_IER) No Effect */
#define   US_IER_TXBUFE_1           (0x1u << 11) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_RXBUFF_Pos           12           /**< \brief (US_IER) Buffer Full Interrupt Enable */
#define US_IER_RXBUFF               (0x1u << US_IER_RXBUFF_Pos)
#define   US_IER_RXBUFF_0           (0x0u << 12) /**< \brief (US_IER) No Effect */
#define   US_IER_RXBUFF_1           (0x1u << 12) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_NACK_Pos             13           /**< \brief (US_IER) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Enable */
#define US_IER_NACK                 (0x1u << US_IER_NACK_Pos)
#define   US_IER_NACK_0             (0x0u << 13) /**< \brief (US_IER) No Effect */
#define   US_IER_NACK_1             (0x1u << 13) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_LINID_Pos            14           /**< \brief (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
#define US_IER_LINID                (0x1u << US_IER_LINID_Pos)
#define US_IER_LINTC_Pos            15           /**< \brief (US_IER) LIN Transfer Conpleted Interrupt Enable */
#define US_IER_LINTC                (0x1u << US_IER_LINTC_Pos)
#define US_IER_RIIC_Pos             16           /**< \brief (US_IER) Ring Indicator Input Change Enable */
#define US_IER_RIIC                 (0x1u << US_IER_RIIC_Pos)
#define   US_IER_RIIC_0             (0x0u << 16) /**< \brief (US_IER) No Effect */
#define   US_IER_RIIC_1             (0x1u << 16) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_DSRIC_Pos            17           /**< \brief (US_IER) Data Set Ready Input Change Enable */
#define US_IER_DSRIC                (0x1u << US_IER_DSRIC_Pos)
#define   US_IER_DSRIC_0            (0x0u << 17) /**< \brief (US_IER) No Effect */
#define   US_IER_DSRIC_1            (0x1u << 17) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_DCDIC_Pos            18           /**< \brief (US_IER) Data Carrier Detect Input Change Interrupt Enable */
#define US_IER_DCDIC                (0x1u << US_IER_DCDIC_Pos)
#define   US_IER_DCDIC_0            (0x0u << 18) /**< \brief (US_IER) No Effect */
#define   US_IER_DCDIC_1            (0x1u << 18) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_CTSIC_Pos            19           /**< \brief (US_IER) Clear to Send Input Change Interrupt Enable */
#define US_IER_CTSIC                (0x1u << US_IER_CTSIC_Pos)
#define   US_IER_CTSIC_0            (0x0u << 19) /**< \brief (US_IER) No Effect */
#define   US_IER_CTSIC_1            (0x1u << 19) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_MANE_Pos             20           /**< \brief (US_IER) Manchester Error Interrupt Enable */
#define US_IER_MANE                 (0x1u << US_IER_MANE_Pos)
#define US_IER_MANEA_Pos            24           /**< \brief (US_IER) Manchester Error Interrupt Enable */
#define US_IER_MANEA                (0x1u << US_IER_MANEA_Pos)
#define   US_IER_MANEA_0            (0x0u << 24) /**< \brief (US_IER) No effect */
#define   US_IER_MANEA_1            (0x1u << 24) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_LINBE_Pos            25           /**< \brief (US_IER) LIN Bus Error Interrupt Enable */
#define US_IER_LINBE                (0x1u << US_IER_LINBE_Pos)
#define US_IER_LINISFE_Pos          26           /**< \brief (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable */
#define US_IER_LINISFE              (0x1u << US_IER_LINISFE_Pos)
#define US_IER_LINIPE_Pos           27           /**< \brief (US_IER) LIN Identifier Parity Interrupt Enable */
#define US_IER_LINIPE               (0x1u << US_IER_LINIPE_Pos)
#define US_IER_LINCE_Pos            28           /**< \brief (US_IER) LIN Checksum Error Interrupt Enable */
#define US_IER_LINCE                (0x1u << US_IER_LINCE_Pos)
#define US_IER_LINSNRE_Pos          29           /**< \brief (US_IER) LIN Slave Not Responding Error Interrupt Enable */
#define US_IER_LINSNRE              (0x1u << US_IER_LINSNRE_Pos)
#define US_IER_LINSTE_Pos           30           /**< \brief (US_IER) LIN Synch Tolerance Error Interrupt Enable */
#define US_IER_LINSTE               (0x1u << US_IER_LINSTE_Pos)
#define   US_IER_LINSTE_0           (0x0u << 30) /**< \brief (US_IER) No Effect */
#define   US_IER_LINSTE_1           (0x1u << 30) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_LINHTE_Pos           31           /**< \brief (US_IER) LIN Header Timeout Error Interrupt Enable */
#define US_IER_LINHTE               (0x1u << US_IER_LINHTE_Pos)
#define   US_IER_LINHTE_0           (0x0u << 31) /**< \brief (US_IER) No Effect */
#define   US_IER_LINHTE_1           (0x1u << 31) /**< \brief (US_IER) Enables the interrupt */
#define US_IER_MASK                 0xFF1FFFFFu  /**< \brief (US_IER) MASK Register */

