aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
// USART mode
#define US_IDR_USART_RXRDY_Pos      0            /**< \brief (US_IDR_USART) Receiver Ready Interrupt Disable */
#define US_IDR_USART_RXRDY          (0x1u << US_IDR_USART_RXRDY_Pos)
#define   US_IDR_USART_RXRDY_0      (0x0u <<  0) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RXRDY_1      (0x1u <<  0) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TXRDY_Pos      1            /**< \brief (US_IDR_USART) Transmitter Ready Interrupt Disable */
#define US_IDR_USART_TXRDY          (0x1u << US_IDR_USART_TXRDY_Pos)
#define   US_IDR_USART_TXRDY_0      (0x0u <<  1) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TXRDY_1      (0x1u <<  1) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RXBRK_Pos      2            /**< \brief (US_IDR_USART) Receiver Break Interrupt Disable */
#define US_IDR_USART_RXBRK          (0x1u << US_IDR_USART_RXBRK_Pos)
#define   US_IDR_USART_RXBRK_0      (0x0u <<  2) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RXBRK_1      (0x1u <<  2) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_ENDRX_Pos      3            /**< \brief (US_IDR_USART) End of Receive Transfer Interrupt Disable */
#define US_IDR_USART_ENDRX          (0x1u << US_IDR_USART_ENDRX_Pos)
#define   US_IDR_USART_ENDRX_0      (0x0u <<  3) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_ENDRX_1      (0x1u <<  3) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_ENDTX_Pos      4            /**< \brief (US_IDR_USART) End of Transmit Interrupt Disable */
#define US_IDR_USART_ENDTX          (0x1u << US_IDR_USART_ENDTX_Pos)
#define   US_IDR_USART_ENDTX_0      (0x0u <<  4) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_ENDTX_1      (0x1u <<  4) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_OVRE_Pos       5            /**< \brief (US_IDR_USART) Overrun Error Interrupt Disable */
#define US_IDR_USART_OVRE           (0x1u << US_IDR_USART_OVRE_Pos)
#define   US_IDR_USART_OVRE_0       (0x0u <<  5) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_OVRE_1       (0x1u <<  5) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_FRAME_Pos      6            /**< \brief (US_IDR_USART) Framing Error Interrupt Disable */
#define US_IDR_USART_FRAME          (0x1u << US_IDR_USART_FRAME_Pos)
#define   US_IDR_USART_FRAME_0      (0x0u <<  6) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_FRAME_1      (0x1u <<  6) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_PARE_Pos       7            /**< \brief (US_IDR_USART) Parity Error Interrupt Disable */
#define US_IDR_USART_PARE           (0x1u << US_IDR_USART_PARE_Pos)
#define   US_IDR_USART_PARE_0       (0x0u <<  7) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_PARE_1       (0x1u <<  7) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TIMEOUT_Pos    8            /**< \brief (US_IDR_USART) Time-out Interrupt Disable */
#define US_IDR_USART_TIMEOUT        (0x1u << US_IDR_USART_TIMEOUT_Pos)
#define   US_IDR_USART_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TXEMPTY_Pos    9            /**< \brief (US_IDR_USART) Transmitter Empty Interrupt Disable */
#define US_IDR_USART_TXEMPTY        (0x1u << US_IDR_USART_TXEMPTY_Pos)
#define   US_IDR_USART_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_ITER_Pos       10           /**< \brief (US_IDR_USART) Iteration Interrupt Disable */
#define US_IDR_USART_ITER           (0x1u << US_IDR_USART_ITER_Pos)
#define   US_IDR_USART_ITER_0       (0x0u << 10) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_ITER_1       (0x1u << 10) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TXBUFE_Pos     11           /**< \brief (US_IDR_USART) Buffer Empty Interrupt Disable */
#define US_IDR_USART_TXBUFE         (0x1u << US_IDR_USART_TXBUFE_Pos)
#define   US_IDR_USART_TXBUFE_0     (0x0u << 11) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TXBUFE_1     (0x1u << 11) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RXBUFF_Pos     12           /**< \brief (US_IDR_USART) Buffer Full Interrupt Disable */
#define US_IDR_USART_RXBUFF         (0x1u << US_IDR_USART_RXBUFF_Pos)
#define   US_IDR_USART_RXBUFF_0     (0x0u << 12) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RXBUFF_1     (0x1u << 12) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_NACK_Pos       13           /**< \brief (US_IDR_USART) Non Acknowledge Interrupt Disable */
#define US_IDR_USART_NACK           (0x1u << US_IDR_USART_NACK_Pos)
#define   US_IDR_USART_NACK_0       (0x0u << 13) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_NACK_1       (0x1u << 13) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RIIC_Pos       16           /**< \brief (US_IDR_USART) Ring Indicator Input Change Disable */
#define US_IDR_USART_RIIC           (0x1u << US_IDR_USART_RIIC_Pos)
#define   US_IDR_USART_RIIC_0       (0x0u << 16) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RIIC_1       (0x1u << 16) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_DSRIC_Pos      17           /**< \brief (US_IDR_USART) Data Set Ready Input Change Disable */
#define US_IDR_USART_DSRIC          (0x1u << US_IDR_USART_DSRIC_Pos)
#define   US_IDR_USART_DSRIC_0      (0x0u << 17) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_DSRIC_1      (0x1u << 17) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_DCDIC_Pos      18           /**< \brief (US_IDR_USART) Data Carrier Detect Input Change Interrupt Disable */
#define US_IDR_USART_DCDIC          (0x1u << US_IDR_USART_DCDIC_Pos)
#define   US_IDR_USART_DCDIC_0      (0x0u << 18) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_DCDIC_1      (0x1u << 18) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_CTSIC_Pos      19           /**< \brief (US_IDR_USART) Clear to Send Input Change Interrupt Disable */
#define US_IDR_USART_CTSIC          (0x1u << US_IDR_USART_CTSIC_Pos)
#define   US_IDR_USART_CTSIC_0      (0x0u << 19) /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_CTSIC_1      (0x1u << 19) /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_MANE_Pos       20           /**< \brief (US_IDR_USART) Manchester Error Interrupt Disable */
#define US_IDR_USART_MANE           (0x1u << US_IDR_USART_MANE_Pos)
#define US_IDR_USART_MANEA_Pos      24           /**< \brief (US_IDR_USART) Manchester Error Interrupt Disable */
#define US_IDR_USART_MANEA          (0x1u << US_IDR_USART_MANEA_Pos)
#define   US_IDR_USART_MANEA_0      (0x0u << 24) /**< \brief (US_IDR_USART) No effect */
#define   US_IDR_USART_MANEA_1      (0x1u << 24) /**< \brief (US_IDR_USART) Disables the corresponding interrupt */
#define US_IDR_USART_MASK           0x011F3FFFu  /**< \brief (US_IDR_USART) MASK Register */

// Any mode
#define US_IDR_RXRDY_Pos            0            /**< \brief (US_IDR) Receiver Ready Interrupt Disable */
#define US_IDR_RXRDY                (0x1u << US_IDR_RXRDY_Pos)
#define   US_IDR_RXRDY_0            (0x0u <<  0) /**< \brief (US_IDR) No Effect */
#define   US_IDR_RXRDY_1            (0x1u <<  0) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TXRDY_Pos            1            /**< \brief (US_IDR) Transmitter Ready Interrupt Disable */
#define US_IDR_TXRDY                (0x1u << US_IDR_TXRDY_Pos)
#define   US_IDR_TXRDY_0            (0x0u <<  1) /**< \brief (US_IDR) No Effect */
#define   US_IDR_TXRDY_1            (0x1u <<  1) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_RXBRK_Pos            2            /**< \brief (US_IDR) Receiver Break Interrupt Disable */
#define US_IDR_RXBRK                (0x1u << US_IDR_RXBRK_Pos)
#define   US_IDR_RXBRK_0            (0x0u <<  2) /**< \brief (US_IDR) No Effect */
#define   US_IDR_RXBRK_1            (0x1u <<  2) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_ENDRX_Pos            3            /**< \brief (US_IDR) End of Receive Transfer Interrupt Disable */
#define US_IDR_ENDRX                (0x1u << US_IDR_ENDRX_Pos)
#define   US_IDR_ENDRX_0            (0x0u <<  3) /**< \brief (US_IDR) No Effect */
#define   US_IDR_ENDRX_1            (0x1u <<  3) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_ENDTX_Pos            4            /**< \brief (US_IDR) End of Transmit Interrupt Disable */
#define US_IDR_ENDTX                (0x1u << US_IDR_ENDTX_Pos)
#define   US_IDR_ENDTX_0            (0x0u <<  4) /**< \brief (US_IDR) No Effect */
#define   US_IDR_ENDTX_1            (0x1u <<  4) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_OVRE_Pos             5            /**< \brief (US_IDR) Overrun Error Interrupt Disable */
#define US_IDR_OVRE                 (0x1u << US_IDR_OVRE_Pos)
#define   US_IDR_OVRE_0             (0x0u <<  5) /**< \brief (US_IDR) No Effect */
#define   US_IDR_OVRE_1             (0x1u <<  5) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_FRAME_Pos            6            /**< \brief (US_IDR) Framing Error Interrupt Disable */
#define US_IDR_FRAME                (0x1u << US_IDR_FRAME_Pos)
#define   US_IDR_FRAME_0            (0x0u <<  6) /**< \brief (US_IDR) No Effect */
#define   US_IDR_FRAME_1            (0x1u <<  6) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_PARE_Pos             7            /**< \brief (US_IDR) Parity Error Interrupt Disable */
#define US_IDR_PARE                 (0x1u << US_IDR_PARE_Pos)
#define   US_IDR_PARE_0             (0x0u <<  7) /**< \brief (US_IDR) No Effect */
#define   US_IDR_PARE_1             (0x1u <<  7) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TIMEOUT_Pos          8            /**< \brief (US_IDR) Time-out Interrupt Disable */
#define US_IDR_TIMEOUT              (0x1u << US_IDR_TIMEOUT_Pos)
#define   US_IDR_TIMEOUT_0          (0x0u <<  8) /**< \brief (US_IDR) No Effect */
#define   US_IDR_TIMEOUT_1          (0x1u <<  8) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TXEMPTY_Pos          9            /**< \brief (US_IDR) Transmitter Empty Interrupt Disable */
#define US_IDR_TXEMPTY              (0x1u << US_IDR_TXEMPTY_Pos)
#define   US_IDR_TXEMPTY_0          (0x0u <<  9) /**< \brief (US_IDR) No Effect */
#define   US_IDR_TXEMPTY_1          (0x1u <<  9) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_ITER_Pos             10           /**< \brief (US_IDR) Iteration Interrupt Disable */
#define US_IDR_ITER                 (0x1u << US_IDR_ITER_Pos)
#define   US_IDR_ITER_0             (0x0u << 10) /**< \brief (US_IDR) No Effect */
#define   US_IDR_ITER_1             (0x1u << 10) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_UNRE_Pos             10           /**< \brief (US_IDR) SPI Underrun Error Interrupt Disable */
#define US_IDR_UNRE                 (0x1u << US_IDR_UNRE_Pos)
#define   US_IDR_UNRE_0             (0x0u << 10) /**< \brief (US_IDR) No Effect */
#define   US_IDR_UNRE_1             (0x1u << 10) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_ITER_Pos             10           /**< \brief (US_IDR) Iteration Interrupt Disable */
#define US_IDR_ITER                 (0x1u << US_IDR_ITER_Pos)
#define   US_IDR_ITER_0             (0x0u << 10) /**< \brief (US_IDR) No Effect */
#define   US_IDR_ITER_1             (0x1u << 10) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TXBUFE_Pos           11           /**< \brief (US_IDR) Buffer Empty Interrupt Disable */
#define US_IDR_TXBUFE               (0x1u << US_IDR_TXBUFE_Pos)
#define   US_IDR_TXBUFE_0           (0x0u << 11) /**< \brief (US_IDR) No Effect */
#define   US_IDR_TXBUFE_1           (0x1u << 11) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_RXBUFF_Pos           12           /**< \brief (US_IDR) Buffer Full Interrupt Disable */
#define US_IDR_RXBUFF               (0x1u << US_IDR_RXBUFF_Pos)
#define   US_IDR_RXBUFF_0           (0x0u << 12) /**< \brief (US_IDR) No Effect */
#define   US_IDR_RXBUFF_1           (0x1u << 12) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_NACK_Pos             13           /**< \brief (US_IDR) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Disable */
#define US_IDR_NACK                 (0x1u << US_IDR_NACK_Pos)
#define   US_IDR_NACK_0             (0x0u << 13) /**< \brief (US_IDR) No Effect */
#define   US_IDR_NACK_1             (0x1u << 13) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_LINID_Pos            14           /**< \brief (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable */
#define US_IDR_LINID                (0x1u << US_IDR_LINID_Pos)
#define US_IDR_LINTC_Pos            15           /**< \brief (US_IDR) LIN Transfer Conpleted Interrupt Disable */
#define US_IDR_LINTC                (0x1u << US_IDR_LINTC_Pos)
#define US_IDR_RIIC_Pos             16           /**< \brief (US_IDR) Ring Indicator Input Change Disable */
#define US_IDR_RIIC                 (0x1u << US_IDR_RIIC_Pos)
#define   US_IDR_RIIC_0             (0x0u << 16) /**< \brief (US_IDR) No Effect */
#define   US_IDR_RIIC_1             (0x1u << 16) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_DSRIC_Pos            17           /**< \brief (US_IDR) Data Set Ready Input Change Disable */
#define US_IDR_DSRIC                (0x1u << US_IDR_DSRIC_Pos)
#define   US_IDR_DSRIC_0            (0x0u << 17) /**< \brief (US_IDR) No Effect */
#define   US_IDR_DSRIC_1            (0x1u << 17) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_DCDIC_Pos            18           /**< \brief (US_IDR) Data Carrier Detect Input Change Interrupt Disable */
#define US_IDR_DCDIC                (0x1u << US_IDR_DCDIC_Pos)
#define   US_IDR_DCDIC_0            (0x0u << 18) /**< \brief (US_IDR) No Effect */
#define   US_IDR_DCDIC_1            (0x1u << 18) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_CTSIC_Pos            19           /**< \brief (US_IDR) Clear to Send Input Change Interrupt Disable */
#define US_IDR_CTSIC                (0x1u << US_IDR_CTSIC_Pos)
#define   US_IDR_CTSIC_0            (0x0u << 19) /**< \brief (US_IDR) No Effect */
#define   US_IDR_CTSIC_1            (0x1u << 19) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_MANE_Pos             20           /**< \brief (US_IDR) Manchester Error Interrupt Disable */
#define US_IDR_MANE                 (0x1u << US_IDR_MANE_Pos)
#define US_IDR_MANEA_Pos            24           /**< \brief (US_IDR) Manchester Error Interrupt Disable */
#define US_IDR_MANEA                (0x1u << US_IDR_MANEA_Pos)
#define   US_IDR_MANEA_0            (0x0u << 24) /**< \brief (US_IDR) No effect */
#define   US_IDR_MANEA_1            (0x1u << 24) /**< \brief (US_IDR) Disables the corresponding interrupt */
#define US_IDR_LINBE_Pos            25           /**< \brief (US_IDR) LIN Bus Error Interrupt Disable */
#define US_IDR_LINBE                (0x1u << US_IDR_LINBE_Pos)
#define US_IDR_LINISFE_Pos          26           /**< \brief (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable */
#define US_IDR_LINISFE              (0x1u << US_IDR_LINISFE_Pos)
#define US_IDR_LINIPE_Pos           27           /**< \brief (US_IDR) LIN Identifier Parity Interrupt Disable */
#define US_IDR_LINIPE               (0x1u << US_IDR_LINIPE_Pos)
#define US_IDR_LINCE_Pos            28           /**< \brief (US_IDR) LIN Checksum Error Interrupt Disable */
#define US_IDR_LINCE                (0x1u << US_IDR_LINCE_Pos)
#define US_IDR_LINSNRE_Pos          29           /**< \brief (US_IDR) LIN Slave Not Responding Error Interrupt Disable */
#define US_IDR_LINSNRE              (0x1u << US_IDR_LINSNRE_Pos)
#define US_IDR_LINSTE_Pos           30           /**< \brief (US_IDR) LIN Synch Tolerance Error Interrupt Disable */
#define US_IDR_LINSTE               (0x1u << US_IDR_LINSTE_Pos)
#define   US_IDR_LINSTE_0           (0x0u << 30) /**< \brief (US_IDR) No Effect */
#define   US_IDR_LINSTE_1           (0x1u << 30) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_LINHTE_Pos           31           /**< \brief (US_IDR) LIN Header Timeout Error Interrupt Disable */
#define US_IDR_LINHTE               (0x1u << US_IDR_LINHTE_Pos)
#define   US_IDR_LINHTE_0           (0x0u << 31) /**< \brief (US_IDR) No Effect */
#define   US_IDR_LINHTE_1           (0x1u << 31) /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_MASK                 0xFF1FFFFFu  /**< \brief (US_IDR) MASK Register */

