aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
// USART mode
#define US_IMR_USART_RXRDY_Pos      0            /**< \brief (US_IMR_USART) RXRDY Interrupt Mask */
#define US_IMR_USART_RXRDY          (0x1u << US_IMR_USART_RXRDY_Pos)
#define   US_IMR_USART_RXRDY_0      (0x0u <<  0) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RXRDY_1      (0x1u <<  0) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TXRDY_Pos      1            /**< \brief (US_IMR_USART) TXRDY Interrupt Mask */
#define US_IMR_USART_TXRDY          (0x1u << US_IMR_USART_TXRDY_Pos)
#define   US_IMR_USART_TXRDY_0      (0x0u <<  1) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TXRDY_1      (0x1u <<  1) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RXBRK_Pos      2            /**< \brief (US_IMR_USART) Receiver Break Interrupt Mask */
#define US_IMR_USART_RXBRK          (0x1u << US_IMR_USART_RXBRK_Pos)
#define   US_IMR_USART_RXBRK_0      (0x0u <<  2) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RXBRK_1      (0x1u <<  2) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_ENDRX_Pos      3            /**< \brief (US_IMR_USART) End of Receive Transfer Interrupt Mask */
#define US_IMR_USART_ENDRX          (0x1u << US_IMR_USART_ENDRX_Pos)
#define   US_IMR_USART_ENDRX_0      (0x0u <<  3) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_ENDRX_1      (0x1u <<  3) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_ENDTX_Pos      4            /**< \brief (US_IMR_USART) End of Transmit Interrupt Mask */
#define US_IMR_USART_ENDTX          (0x1u << US_IMR_USART_ENDTX_Pos)
#define   US_IMR_USART_ENDTX_0      (0x0u <<  4) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_ENDTX_1      (0x1u <<  4) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_OVRE_Pos       5            /**< \brief (US_IMR_USART) Overrun Error Interrupt Mask */
#define US_IMR_USART_OVRE           (0x1u << US_IMR_USART_OVRE_Pos)
#define   US_IMR_USART_OVRE_0       (0x0u <<  5) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_OVRE_1       (0x1u <<  5) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_FRAME_Pos      6            /**< \brief (US_IMR_USART) Framing Error Interrupt Mask */
#define US_IMR_USART_FRAME          (0x1u << US_IMR_USART_FRAME_Pos)
#define   US_IMR_USART_FRAME_0      (0x0u <<  6) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_FRAME_1      (0x1u <<  6) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_PARE_Pos       7            /**< \brief (US_IMR_USART) Parity Error Interrupt Mask */
#define US_IMR_USART_PARE           (0x1u << US_IMR_USART_PARE_Pos)
#define   US_IMR_USART_PARE_0       (0x0u <<  7) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_PARE_1       (0x1u <<  7) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TIMEOUT_Pos    8            /**< \brief (US_IMR_USART) Time-out Interrupt Mask */
#define US_IMR_USART_TIMEOUT        (0x1u << US_IMR_USART_TIMEOUT_Pos)
#define   US_IMR_USART_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TXEMPTY_Pos    9            /**< \brief (US_IMR_USART) TXEMPTY Interrupt Mask */
#define US_IMR_USART_TXEMPTY        (0x1u << US_IMR_USART_TXEMPTY_Pos)
#define   US_IMR_USART_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_ITER_Pos       10           /**< \brief (US_IMR_USART) Iteration Interrupt Mask */
#define US_IMR_USART_ITER           (0x1u << US_IMR_USART_ITER_Pos)
#define   US_IMR_USART_ITER_0       (0x0u << 10) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_ITER_1       (0x1u << 10) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TXBUFE_Pos     11           /**< \brief (US_IMR_USART) Buffer Empty Interrupt Mask */
#define US_IMR_USART_TXBUFE         (0x1u << US_IMR_USART_TXBUFE_Pos)
#define   US_IMR_USART_TXBUFE_0     (0x0u << 11) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TXBUFE_1     (0x1u << 11) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RXBUFF_Pos     12           /**< \brief (US_IMR_USART) Buffer Full Interrupt Mask */
#define US_IMR_USART_RXBUFF         (0x1u << US_IMR_USART_RXBUFF_Pos)
#define   US_IMR_USART_RXBUFF_0     (0x0u << 12) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RXBUFF_1     (0x1u << 12) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_NACK_Pos       13           /**< \brief (US_IMR_USART) Non Acknowledge Interrupt Mask */
#define US_IMR_USART_NACK           (0x1u << US_IMR_USART_NACK_Pos)
#define   US_IMR_USART_NACK_0       (0x0u << 13) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_NACK_1       (0x1u << 13) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RIIC_Pos       16           /**< \brief (US_IMR_USART) Ring Indicator Input Change Mask */
#define US_IMR_USART_RIIC           (0x1u << US_IMR_USART_RIIC_Pos)
#define   US_IMR_USART_RIIC_0       (0x0u << 16) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RIIC_1       (0x1u << 16) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_DSRIC_Pos      17           /**< \brief (US_IMR_USART) Data Set Ready Input Change Mask */
#define US_IMR_USART_DSRIC          (0x1u << US_IMR_USART_DSRIC_Pos)
#define   US_IMR_USART_DSRIC_0      (0x0u << 17) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_DSRIC_1      (0x1u << 17) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_DCDIC_Pos      18           /**< \brief (US_IMR_USART) Data Carrier Detect Input Change Interrupt Mask */
#define US_IMR_USART_DCDIC          (0x1u << US_IMR_USART_DCDIC_Pos)
#define   US_IMR_USART_DCDIC_0      (0x0u << 18) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_DCDIC_1      (0x1u << 18) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_CTSIC_Pos      19           /**< \brief (US_IMR_USART) Clear to Send Input Change Interrupt Mask */
#define US_IMR_USART_CTSIC          (0x1u << US_IMR_USART_CTSIC_Pos)
#define   US_IMR_USART_CTSIC_0      (0x0u << 19) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_CTSIC_1      (0x1u << 19) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_MANE_Pos       20           /**< \brief (US_IMR_USART) Manchester Error Interrupt Mask */
#define US_IMR_USART_MANE           (0x1u << US_IMR_USART_MANE_Pos)
#define US_IMR_USART_MANEA_Pos      24           /**< \brief (US_IMR_USART) Manchester Error Interrupt Mask */
#define US_IMR_USART_MANEA          (0x1u << US_IMR_USART_MANEA_Pos)
#define   US_IMR_USART_MANEA_0      (0x0u << 24) /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_MANEA_1      (0x1u << 24) /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_MASK           0x011F3FFFu  /**< \brief (US_IMR_USART) MASK Register */

// Any mode
#define US_IMR_RXRDY_Pos            0            /**< \brief (US_IMR) RXRDY Interrupt Mask */
#define US_IMR_RXRDY                (0x1u << US_IMR_RXRDY_Pos)
#define   US_IMR_RXRDY_0            (0x0u <<  0) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RXRDY_1            (0x1u <<  0) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TXRDY_Pos            1            /**< \brief (US_IMR) TXRDY Interrupt Mask */
#define US_IMR_TXRDY                (0x1u << US_IMR_TXRDY_Pos)
#define   US_IMR_TXRDY_0            (0x0u <<  1) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TXRDY_1            (0x1u <<  1) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_RXBRK_Pos            2            /**< \brief (US_IMR) Receiver Break Interrupt Mask */
#define US_IMR_RXBRK                (0x1u << US_IMR_RXBRK_Pos)
#define   US_IMR_RXBRK_0            (0x0u <<  2) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RXBRK_1            (0x1u <<  2) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_ENDRX_Pos            3            /**< \brief (US_IMR) End of Receive Transfer Interrupt Mask */
#define US_IMR_ENDRX                (0x1u << US_IMR_ENDRX_Pos)
#define   US_IMR_ENDRX_0            (0x0u <<  3) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_ENDRX_1            (0x1u <<  3) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_ENDTX_Pos            4            /**< \brief (US_IMR) End of Transmit Interrupt Mask */
#define US_IMR_ENDTX                (0x1u << US_IMR_ENDTX_Pos)
#define   US_IMR_ENDTX_0            (0x0u <<  4) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_ENDTX_1            (0x1u <<  4) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_OVRE_Pos             5            /**< \brief (US_IMR) Overrun Error Interrupt Mask */
#define US_IMR_OVRE                 (0x1u << US_IMR_OVRE_Pos)
#define   US_IMR_OVRE_0             (0x0u <<  5) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_OVRE_1             (0x1u <<  5) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_FRAME_Pos            6            /**< \brief (US_IMR) Framing Error Interrupt Mask */
#define US_IMR_FRAME                (0x1u << US_IMR_FRAME_Pos)
#define   US_IMR_FRAME_0            (0x0u <<  6) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_FRAME_1            (0x1u <<  6) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_PARE_Pos             7            /**< \brief (US_IMR) Parity Error Interrupt Mask */
#define US_IMR_PARE                 (0x1u << US_IMR_PARE_Pos)
#define   US_IMR_PARE_0             (0x0u <<  7) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_PARE_1             (0x1u <<  7) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TIMEOUT_Pos          8            /**< \brief (US_IMR) Time-out Interrupt Mask */
#define US_IMR_TIMEOUT              (0x1u << US_IMR_TIMEOUT_Pos)
#define   US_IMR_TIMEOUT_0          (0x0u <<  8) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TIMEOUT_1          (0x1u <<  8) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TXEMPTY_Pos          9            /**< \brief (US_IMR) TXEMPTY Interrupt Mask */
#define US_IMR_TXEMPTY              (0x1u << US_IMR_TXEMPTY_Pos)
#define   US_IMR_TXEMPTY_0          (0x0u <<  9) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TXEMPTY_1          (0x1u <<  9) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_ITER_Pos             10           /**< \brief (US_IMR) Iteration Interrupt Mask */
#define US_IMR_ITER                 (0x1u << US_IMR_ITER_Pos)
#define   US_IMR_ITER_0             (0x0u << 10) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_ITER_1             (0x1u << 10) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_UNRE_Pos             10           /**< \brief (US_IMR) SPI Underrun Error Interrupt Mask */
#define US_IMR_UNRE                 (0x1u << US_IMR_UNRE_Pos)
#define   US_IMR_UNRE_0             (0x0u << 10) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_UNRE_1             (0x1u << 10) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_ITER_Pos             10           /**< \brief (US_IMR) Iteration Interrupt Mask */
#define US_IMR_ITER                 (0x1u << US_IMR_ITER_Pos)
#define   US_IMR_ITER_0             (0x0u << 10) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_ITER_1             (0x1u << 10) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TXBUFE_Pos           11           /**< \brief (US_IMR) Buffer Empty Interrupt Mask */
#define US_IMR_TXBUFE               (0x1u << US_IMR_TXBUFE_Pos)
#define   US_IMR_TXBUFE_0           (0x0u << 11) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TXBUFE_1           (0x1u << 11) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_RXBUFF_Pos           12           /**< \brief (US_IMR) Buffer Full Interrupt Mask */
#define US_IMR_RXBUFF               (0x1u << US_IMR_RXBUFF_Pos)
#define   US_IMR_RXBUFF_0           (0x0u << 12) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RXBUFF_1           (0x1u << 12) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_NACK_Pos             13           /**< \brief (US_IMR) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Mask */
#define US_IMR_NACK                 (0x1u << US_IMR_NACK_Pos)
#define   US_IMR_NACK_0             (0x0u << 13) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_NACK_1             (0x1u << 13) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_LINID_Pos            14           /**< \brief (US_IMR) LIN Identifier Sent or LIN Received Interrupt Mask */
#define US_IMR_LINID                (0x1u << US_IMR_LINID_Pos)
#define US_IMR_LINTC_Pos            15           /**< \brief (US_IMR) LIN Transfer Conpleted Interrupt Mask */
#define US_IMR_LINTC                (0x1u << US_IMR_LINTC_Pos)
#define US_IMR_RIIC_Pos             16           /**< \brief (US_IMR) Ring Indicator Input Change Mask */
#define US_IMR_RIIC                 (0x1u << US_IMR_RIIC_Pos)
#define   US_IMR_RIIC_0             (0x0u << 16) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RIIC_1             (0x1u << 16) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_DSRIC_Pos            17           /**< \brief (US_IMR) Data Set Ready Input Change Mask */
#define US_IMR_DSRIC                (0x1u << US_IMR_DSRIC_Pos)
#define   US_IMR_DSRIC_0            (0x0u << 17) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_DSRIC_1            (0x1u << 17) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_DCDIC_Pos            18           /**< \brief (US_IMR) Data Carrier Detect Input Change Interrupt Mask */
#define US_IMR_DCDIC                (0x1u << US_IMR_DCDIC_Pos)
#define   US_IMR_DCDIC_0            (0x0u << 18) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_DCDIC_1            (0x1u << 18) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_CTSIC_Pos            19           /**< \brief (US_IMR) Clear to Send Input Change Interrupt Mask */
#define US_IMR_CTSIC                (0x1u << US_IMR_CTSIC_Pos)
#define   US_IMR_CTSIC_0            (0x0u << 19) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_CTSIC_1            (0x1u << 19) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_MANE_Pos             20           /**< \brief (US_IMR) Manchester Error Interrupt Mask */
#define US_IMR_MANE                 (0x1u << US_IMR_MANE_Pos)
#define US_IMR_MANEA_Pos            24           /**< \brief (US_IMR) Manchester Error Interrupt Mask */
#define US_IMR_MANEA                (0x1u << US_IMR_MANEA_Pos)
#define   US_IMR_MANEA_0            (0x0u << 24) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_MANEA_1            (0x1u << 24) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_LINBE_Pos            25           /**< \brief (US_IMR) LIN Bus Error Interrupt Mask */
#define US_IMR_LINBE                (0x1u << US_IMR_LINBE_Pos)
#define US_IMR_LINISFE_Pos          26           /**< \brief (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask */
#define US_IMR_LINISFE              (0x1u << US_IMR_LINISFE_Pos)
#define US_IMR_LINIPE_Pos           27           /**< \brief (US_IMR) LIN Identifier Parity Interrupt Mask */
#define US_IMR_LINIPE               (0x1u << US_IMR_LINIPE_Pos)
#define US_IMR_LINCE_Pos            28           /**< \brief (US_IMR) LIN Checksum Error Interrupt Mask */
#define US_IMR_LINCE                (0x1u << US_IMR_LINCE_Pos)
#define US_IMR_LINSNRE_Pos          29           /**< \brief (US_IMR) LIN Slave Not Responding Error Interrupt Mask */
#define US_IMR_LINSNRE              (0x1u << US_IMR_LINSNRE_Pos)
#define US_IMR_LINSTE_Pos           30           /**< \brief (US_IMR) LIN Synch Tolerance Error Interrupt Mask */
#define US_IMR_LINSTE               (0x1u << US_IMR_LINSTE_Pos)
#define   US_IMR_LINSTE_0           (0x0u << 30) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_LINSTE_1           (0x1u << 30) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_LINHTE_Pos           31           /**< \brief (US_IMR) LIN Header Timeout Error Interrupt Mask */
#define US_IMR_LINHTE               (0x1u << US_IMR_LINHTE_Pos)
#define   US_IMR_LINHTE_0           (0x0u << 31) /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_LINHTE_1           (0x1u << 31) /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_MASK                 0xFF1FFFFFu  /**< \brief (US_IMR) MASK Register */

/* -------- US_CSR : (USART Offset: 0x14) (R/  32) Channel Status Register -------- */
#define US_CSR_OFFSET               0x14         /**< \brief (US_CSR offset) Channel Status Register */
#define US_CSR_RESETVALUE           0x00000000   /**< \brief (US_CSR reset_value) Channel Status Register */

