aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
// LIN mode
#define US_CSR_LIN_RXRDY_Pos        0            /**< \brief (US_CSR_LIN) Receiver Ready */
#define US_CSR_LIN_RXRDY            (0x1u << US_CSR_LIN_RXRDY_Pos)
#define   US_CSR_LIN_RXRDY_0        (0x0u <<  0) /**< \brief (US_CSR_LIN) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_LIN_RXRDY_1        (0x1u <<  0) /**< \brief (US_CSR_LIN) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_LIN_TXRDY_Pos        1            /**< \brief (US_CSR_LIN) Transmitter Ready */
#define US_CSR_LIN_TXRDY            (0x1u << US_CSR_LIN_TXRDY_Pos)
#define   US_CSR_LIN_TXRDY_0        (0x0u <<  1) /**< \brief (US_CSR_LIN) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_LIN_TXRDY_1        (0x1u <<  1) /**< \brief (US_CSR_LIN) There is no character in the THR */
#define US_CSR_LIN_RXBRK_Pos        2            /**< \brief (US_CSR_LIN) Break Received/End of Break */
#define US_CSR_LIN_RXBRK            (0x1u << US_CSR_LIN_RXBRK_Pos)
#define   US_CSR_LIN_RXBRK_0        (0x0u <<  2) /**< \brief (US_CSR_LIN) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_LIN_RXBRK_1        (0x1u <<  2) /**< \brief (US_CSR_LIN) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_LIN_ENDRX_Pos        3            /**< \brief (US_CSR_LIN) End of Receiver Transfer */
#define US_CSR_LIN_ENDRX            (0x1u << US_CSR_LIN_ENDRX_Pos)
#define   US_CSR_LIN_ENDRX_0        (0x0u <<  3) /**< \brief (US_CSR_LIN) The End of Transfer signal from the Receive PDC channel is inactive */
#define   US_CSR_LIN_ENDRX_1        (0x1u <<  3) /**< \brief (US_CSR_LIN) The End of Transfer signal from the Receive PDC channel is active */
#define US_CSR_LIN_ENDTX_Pos        4            /**< \brief (US_CSR_LIN) End of Transmitter Transfer */
#define US_CSR_LIN_ENDTX            (0x1u << US_CSR_LIN_ENDTX_Pos)
#define   US_CSR_LIN_ENDTX_0        (0x0u <<  4) /**< \brief (US_CSR_LIN) The End of Transfer signal from the Transmit PDC channel is inactive */
#define   US_CSR_LIN_ENDTX_1        (0x1u <<  4) /**< \brief (US_CSR_LIN) The End of Transfer signal from the Transmit PDC channel is active */
#define US_CSR_LIN_OVRE_Pos         5            /**< \brief (US_CSR_LIN) Overrun Error */
#define US_CSR_LIN_OVRE             (0x1u << US_CSR_LIN_OVRE_Pos)
#define   US_CSR_LIN_OVRE_0         (0x0u <<  5) /**< \brief (US_CSR_LIN) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_LIN_OVRE_1         (0x1u <<  5) /**< \brief (US_CSR_LIN) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_LIN_FRAME_Pos        6            /**< \brief (US_CSR_LIN) Framing Error */
#define US_CSR_LIN_FRAME            (0x1u << US_CSR_LIN_FRAME_Pos)
#define   US_CSR_LIN_FRAME_0        (0x0u <<  6) /**< \brief (US_CSR_LIN) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_LIN_FRAME_1        (0x1u <<  6) /**< \brief (US_CSR_LIN) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_LIN_PARE_Pos         7            /**< \brief (US_CSR_LIN) Parity Error */
#define US_CSR_LIN_PARE             (0x1u << US_CSR_LIN_PARE_Pos)
#define   US_CSR_LIN_PARE_0         (0x0u <<  7) /**< \brief (US_CSR_LIN) No parity error has been detected since the last RSTSTA */
#define   US_CSR_LIN_PARE_1         (0x1u <<  7) /**< \brief (US_CSR_LIN) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_LIN_TIMEOUT_Pos      8            /**< \brief (US_CSR_LIN) Receiver Time-out */
#define US_CSR_LIN_TIMEOUT          (0x1u << US_CSR_LIN_TIMEOUT_Pos)
#define   US_CSR_LIN_TIMEOUT_0      (0x0u <<  8) /**< \brief (US_CSR_LIN) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_LIN_TIMEOUT_1      (0x1u <<  8) /**< \brief (US_CSR_LIN) There has been a time-out since the last Start Time-out command */
#define US_CSR_LIN_TXEMPTY_Pos      9            /**< \brief (US_CSR_LIN) Transmitter Empty */
#define US_CSR_LIN_TXEMPTY          (0x1u << US_CSR_LIN_TXEMPTY_Pos)
#define   US_CSR_LIN_TXEMPTY_0      (0x0u <<  9) /**< \brief (US_CSR_LIN) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_LIN_TXEMPTY_1      (0x1u <<  9) /**< \brief (US_CSR_LIN) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_LIN_ITER_Pos         10           /**< \brief (US_CSR_LIN) Max number of Repetitions Reached */
#define US_CSR_LIN_ITER             (0x1u << US_CSR_LIN_ITER_Pos)
#define   US_CSR_LIN_ITER_0         (0x0u << 10) /**< \brief (US_CSR_LIN) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_LIN_ITER_1         (0x1u << 10) /**< \brief (US_CSR_LIN) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_LIN_TXBUFE_Pos       11           /**< \brief (US_CSR_LIN) Transmission Buffer Empty */
#define US_CSR_LIN_TXBUFE           (0x1u << US_CSR_LIN_TXBUFE_Pos)
#define   US_CSR_LIN_TXBUFE_0       (0x0u << 11) /**< \brief (US_CSR_LIN) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_CSR_LIN_TXBUFE_1       (0x1u << 11) /**< \brief (US_CSR_LIN) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_CSR_LIN_RXBUFF_Pos       12           /**< \brief (US_CSR_LIN) Reception Buffer Full */
#define US_CSR_LIN_RXBUFF           (0x1u << US_CSR_LIN_RXBUFF_Pos)
#define   US_CSR_LIN_RXBUFF_0       (0x0u << 12) /**< \brief (US_CSR_LIN) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_LIN_RXBUFF_1       (0x1u << 12) /**< \brief (US_CSR_LIN) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_LIN_NACK_Pos         13           /**< \brief (US_CSR_LIN) Non Acknowledge or LIN Break Sent or LIN Break Received */
#define US_CSR_LIN_NACK             (0x1u << US_CSR_LIN_NACK_Pos)
#define   US_CSR_LIN_NACK_0         (0x0u << 13) /**< \brief (US_CSR_LIN) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_LIN_NACK_1         (0x1u << 13) /**< \brief (US_CSR_LIN) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_LIN_LINID_Pos        14           /**< \brief (US_CSR_LIN) LIN Identifier Sent or LIN Identifier Received */
#define US_CSR_LIN_LINID            (0x1u << US_CSR_LIN_LINID_Pos)
#define US_CSR_LIN_LINTC_Pos        15           /**< \brief (US_CSR_LIN) LIN Transfer Conpleted */
#define US_CSR_LIN_LINTC            (0x1u << US_CSR_LIN_LINTC_Pos)
#define US_CSR_LIN_RIIC_Pos         16           /**< \brief (US_CSR_LIN) Ring Indicator Input Change Flag */
#define US_CSR_LIN_RIIC             (0x1u << US_CSR_LIN_RIIC_Pos)
#define   US_CSR_LIN_RIIC_0         (0x0u << 16) /**< \brief (US_CSR_LIN) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_LIN_RIIC_1         (0x1u << 16) /**< \brief (US_CSR_LIN) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_LIN_DSRIC_Pos        17           /**< \brief (US_CSR_LIN) Data Set Ready Input Change Flag */
#define US_CSR_LIN_DSRIC            (0x1u << US_CSR_LIN_DSRIC_Pos)
#define   US_CSR_LIN_DSRIC_0        (0x0u << 17) /**< \brief (US_CSR_LIN) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_LIN_DSRIC_1        (0x1u << 17) /**< \brief (US_CSR_LIN) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_LIN_DCDIC_Pos        18           /**< \brief (US_CSR_LIN) Data Carrier Detect Input Change Flag */
#define US_CSR_LIN_DCDIC            (0x1u << US_CSR_LIN_DCDIC_Pos)
#define   US_CSR_LIN_DCDIC_0        (0x0u << 18) /**< \brief (US_CSR_LIN) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_LIN_DCDIC_1        (0x1u << 18) /**< \brief (US_CSR_LIN) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_LIN_CTSIC_Pos        19           /**< \brief (US_CSR_LIN) Clear to Send Input Change Flag */
#define US_CSR_LIN_CTSIC            (0x1u << US_CSR_LIN_CTSIC_Pos)
#define   US_CSR_LIN_CTSIC_0        (0x0u << 19) /**< \brief (US_CSR_LIN) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_LIN_CTSIC_1        (0x1u << 19) /**< \brief (US_CSR_LIN) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_LIN_RI_Pos           20           /**< \brief (US_CSR_LIN) Image of RI Input */
#define US_CSR_LIN_RI               (0x1u << US_CSR_LIN_RI_Pos)
#define   US_CSR_LIN_RI_0           (0x0u << 20) /**< \brief (US_CSR_LIN) RI is at 0 */
#define   US_CSR_LIN_RI_1           (0x1u << 20) /**< \brief (US_CSR_LIN) RI is at 1 */
#define US_CSR_LIN_DSR_Pos          21           /**< \brief (US_CSR_LIN) Image of DSR Input */
#define US_CSR_LIN_DSR              (0x1u << US_CSR_LIN_DSR_Pos)
#define   US_CSR_LIN_DSR_0          (0x0u << 21) /**< \brief (US_CSR_LIN) DSR is at 0 */
#define   US_CSR_LIN_DSR_1          (0x1u << 21) /**< \brief (US_CSR_LIN) DSR is at 1 */
#define US_CSR_LIN_DCD_Pos          22           /**< \brief (US_CSR_LIN) Image of DCD Input */
#define US_CSR_LIN_DCD              (0x1u << US_CSR_LIN_DCD_Pos)
#define   US_CSR_LIN_DCD_0          (0x0u << 22) /**< \brief (US_CSR_LIN) DCD is at 0 */
#define   US_CSR_LIN_DCD_1          (0x1u << 22) /**< \brief (US_CSR_LIN) DCD is at 1 */
#define US_CSR_LIN_LINBLS_Pos       23           /**< \brief (US_CSR_LIN) LIN Bus Line Status */
#define US_CSR_LIN_LINBLS           (0x1u << US_CSR_LIN_LINBLS_Pos)
#define   US_CSR_LIN_LINBLS_0       (0x0u << 23) /**< \brief (US_CSR_LIN) CTS is at 0 */
#define   US_CSR_LIN_LINBLS_1       (0x1u << 23) /**< \brief (US_CSR_LIN) CTS is at 1 */
#define US_CSR_LIN_LINBE_Pos        25           /**< \brief (US_CSR_LIN) LIN Bit Error */
#define US_CSR_LIN_LINBE            (0x1u << US_CSR_LIN_LINBE_Pos)
#define US_CSR_LIN_LINISFE_Pos      26           /**< \brief (US_CSR_LIN) LIN Inconsistent Synch Field Error */
#define US_CSR_LIN_LINISFE          (0x1u << US_CSR_LIN_LINISFE_Pos)
#define US_CSR_LIN_LINIPE_Pos       27           /**< \brief (US_CSR_LIN) LIN Identifier Parity Error */
#define US_CSR_LIN_LINIPE           (0x1u << US_CSR_LIN_LINIPE_Pos)
#define US_CSR_LIN_LINCE_Pos        28           /**< \brief (US_CSR_LIN) LIN Checksum Error */
#define US_CSR_LIN_LINCE            (0x1u << US_CSR_LIN_LINCE_Pos)
#define US_CSR_LIN_LINSNRE_Pos      29           /**< \brief (US_CSR_LIN) LIN Slave Not Responding Error */
#define US_CSR_LIN_LINSNRE          (0x1u << US_CSR_LIN_LINSNRE_Pos)
#define US_CSR_LIN_LINSTE_Pos       30           /**< \brief (US_CSR_LIN) LIN Synch Tolerance Error */
#define US_CSR_LIN_LINSTE           (0x1u << US_CSR_LIN_LINSTE_Pos)
#define   US_CSR_LIN_LINSTE_0       (0x0u << 30) /**< \brief (US_CSR_LIN) COMM_TX is at 0 */
#define   US_CSR_LIN_LINSTE_1       (0x1u << 30) /**< \brief (US_CSR_LIN) COMM_TX is at 1 */
#define US_CSR_LIN_LINHTE_Pos       31           /**< \brief (US_CSR_LIN) LIN Header Timeout Error */
#define US_CSR_LIN_LINHTE           (0x1u << US_CSR_LIN_LINHTE_Pos)
#define   US_CSR_LIN_LINHTE_0       (0x0u << 31) /**< \brief (US_CSR_LIN) COMM_RX is at 0 */
#define   US_CSR_LIN_LINHTE_1       (0x1u << 31) /**< \brief (US_CSR_LIN) COMM_RX is at 1 */
#define US_CSR_LIN_MASK             0xFEFFFFFFu  /**< \brief (US_CSR_LIN) MASK Register */

// SPI_SLAVE mode
#define US_CSR_SPI_SLAVE_RXRDY_Pos  0            /**< \brief (US_CSR_SPI_SLAVE) Receiver Ready */
#define US_CSR_SPI_SLAVE_RXRDY      (0x1u << US_CSR_SPI_SLAVE_RXRDY_Pos)
#define   US_CSR_SPI_SLAVE_RXRDY_0  (0x0u <<  0) /**< \brief (US_CSR_SPI_SLAVE) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_SPI_SLAVE_RXRDY_1  (0x1u <<  0) /**< \brief (US_CSR_SPI_SLAVE) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_SPI_SLAVE_TXRDY_Pos  1            /**< \brief (US_CSR_SPI_SLAVE) Transmitter Ready */
#define US_CSR_SPI_SLAVE_TXRDY      (0x1u << US_CSR_SPI_SLAVE_TXRDY_Pos)
#define   US_CSR_SPI_SLAVE_TXRDY_0  (0x0u <<  1) /**< \brief (US_CSR_SPI_SLAVE) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_SPI_SLAVE_TXRDY_1  (0x1u <<  1) /**< \brief (US_CSR_SPI_SLAVE) There is no character in the THR */
#define US_CSR_SPI_SLAVE_RXBRK_Pos  2            /**< \brief (US_CSR_SPI_SLAVE) Break Received/End of Break */
#define US_CSR_SPI_SLAVE_RXBRK      (0x1u << US_CSR_SPI_SLAVE_RXBRK_Pos)
#define   US_CSR_SPI_SLAVE_RXBRK_0  (0x0u <<  2) /**< \brief (US_CSR_SPI_SLAVE) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_RXBRK_1  (0x1u <<  2) /**< \brief (US_CSR_SPI_SLAVE) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_SPI_SLAVE_ENDRX_Pos  3            /**< \brief (US_CSR_SPI_SLAVE) End of Receiver Transfer */
#define US_CSR_SPI_SLAVE_ENDRX      (0x1u << US_CSR_SPI_SLAVE_ENDRX_Pos)
#define   US_CSR_SPI_SLAVE_ENDRX_0  (0x0u <<  3) /**< \brief (US_CSR_SPI_SLAVE) The End of Transfer signal from the Receive PDC channel is inactive */
#define   US_CSR_SPI_SLAVE_ENDRX_1  (0x1u <<  3) /**< \brief (US_CSR_SPI_SLAVE) The End of Transfer signal from the Receive PDC channel is active */
#define US_CSR_SPI_SLAVE_ENDTX_Pos  4            /**< \brief (US_CSR_SPI_SLAVE) End of Transmitter Transfer */
#define US_CSR_SPI_SLAVE_ENDTX      (0x1u << US_CSR_SPI_SLAVE_ENDTX_Pos)
#define   US_CSR_SPI_SLAVE_ENDTX_0  (0x0u <<  4) /**< \brief (US_CSR_SPI_SLAVE) The End of Transfer signal from the Transmit PDC channel is inactive */
#define   US_CSR_SPI_SLAVE_ENDTX_1  (0x1u <<  4) /**< \brief (US_CSR_SPI_SLAVE) The End of Transfer signal from the Transmit PDC channel is active */
#define US_CSR_SPI_SLAVE_OVRE_Pos   5            /**< \brief (US_CSR_SPI_SLAVE) Overrun Error */
#define US_CSR_SPI_SLAVE_OVRE       (0x1u << US_CSR_SPI_SLAVE_OVRE_Pos)
#define   US_CSR_SPI_SLAVE_OVRE_0   (0x0u <<  5) /**< \brief (US_CSR_SPI_SLAVE) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_OVRE_1   (0x1u <<  5) /**< \brief (US_CSR_SPI_SLAVE) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_SPI_SLAVE_FRAME_Pos  6            /**< \brief (US_CSR_SPI_SLAVE) Framing Error */
#define US_CSR_SPI_SLAVE_FRAME      (0x1u << US_CSR_SPI_SLAVE_FRAME_Pos)
#define   US_CSR_SPI_SLAVE_FRAME_0  (0x0u <<  6) /**< \brief (US_CSR_SPI_SLAVE) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_FRAME_1  (0x1u <<  6) /**< \brief (US_CSR_SPI_SLAVE) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_SPI_SLAVE_PARE_Pos   7            /**< \brief (US_CSR_SPI_SLAVE) Parity Error */
#define US_CSR_SPI_SLAVE_PARE       (0x1u << US_CSR_SPI_SLAVE_PARE_Pos)
#define   US_CSR_SPI_SLAVE_PARE_0   (0x0u <<  7) /**< \brief (US_CSR_SPI_SLAVE) No parity error has been detected since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_PARE_1   (0x1u <<  7) /**< \brief (US_CSR_SPI_SLAVE) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_SPI_SLAVE_TIMEOUT_Pos 8            /**< \brief (US_CSR_SPI_SLAVE) Receiver Time-out */
#define US_CSR_SPI_SLAVE_TIMEOUT    (0x1u << US_CSR_SPI_SLAVE_TIMEOUT_Pos)
#define   US_CSR_SPI_SLAVE_TIMEOUT_0 (0x0u <<  8) /**< \brief (US_CSR_SPI_SLAVE) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_SPI_SLAVE_TIMEOUT_1 (0x1u <<  8) /**< \brief (US_CSR_SPI_SLAVE) There has been a time-out since the last Start Time-out command */
#define US_CSR_SPI_SLAVE_TXEMPTY_Pos 9            /**< \brief (US_CSR_SPI_SLAVE) Transmitter Empty */
#define US_CSR_SPI_SLAVE_TXEMPTY    (0x1u << US_CSR_SPI_SLAVE_TXEMPTY_Pos)
#define   US_CSR_SPI_SLAVE_TXEMPTY_0 (0x0u <<  9) /**< \brief (US_CSR_SPI_SLAVE) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_SPI_SLAVE_TXEMPTY_1 (0x1u <<  9) /**< \brief (US_CSR_SPI_SLAVE) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_SPI_SLAVE_UNRE_Pos   10           /**< \brief (US_CSR_SPI_SLAVE) SPI Underrun Error */
#define US_CSR_SPI_SLAVE_UNRE       (0x1u << US_CSR_SPI_SLAVE_UNRE_Pos)
#define   US_CSR_SPI_SLAVE_UNRE_0   (0x0u << 10) /**< \brief (US_CSR_SPI_SLAVE) No SPI underrun error has occurred since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_UNRE_1   (0x1u << 10) /**< \brief (US_CSR_SPI_SLAVE) At least one SPI underrun error has occurred since the last RSTSTA */
#define US_CSR_SPI_SLAVE_TXBUFE_Pos 11           /**< \brief (US_CSR_SPI_SLAVE) Transmission Buffer Empty */
#define US_CSR_SPI_SLAVE_TXBUFE     (0x1u << US_CSR_SPI_SLAVE_TXBUFE_Pos)
#define   US_CSR_SPI_SLAVE_TXBUFE_0 (0x0u << 11) /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_CSR_SPI_SLAVE_TXBUFE_1 (0x1u << 11) /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_CSR_SPI_SLAVE_RXBUFF_Pos 12           /**< \brief (US_CSR_SPI_SLAVE) Reception Buffer Full */
#define US_CSR_SPI_SLAVE_RXBUFF     (0x1u << US_CSR_SPI_SLAVE_RXBUFF_Pos)
#define   US_CSR_SPI_SLAVE_RXBUFF_0 (0x0u << 12) /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_SPI_SLAVE_RXBUFF_1 (0x1u << 12) /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_SPI_SLAVE_NACK_Pos   13           /**< \brief (US_CSR_SPI_SLAVE) Non Acknowledge */
#define US_CSR_SPI_SLAVE_NACK       (0x1u << US_CSR_SPI_SLAVE_NACK_Pos)
#define   US_CSR_SPI_SLAVE_NACK_0   (0x0u << 13) /**< \brief (US_CSR_SPI_SLAVE) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_SPI_SLAVE_NACK_1   (0x1u << 13) /**< \brief (US_CSR_SPI_SLAVE) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_SPI_SLAVE_RIIC_Pos   16           /**< \brief (US_CSR_SPI_SLAVE) Ring Indicator Input Change Flag */
#define US_CSR_SPI_SLAVE_RIIC       (0x1u << US_CSR_SPI_SLAVE_RIIC_Pos)
#define   US_CSR_SPI_SLAVE_RIIC_0   (0x0u << 16) /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_RIIC_1   (0x1u << 16) /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_DSRIC_Pos  17           /**< \brief (US_CSR_SPI_SLAVE) Data Set Ready Input Change Flag */
#define US_CSR_SPI_SLAVE_DSRIC      (0x1u << US_CSR_SPI_SLAVE_DSRIC_Pos)
#define   US_CSR_SPI_SLAVE_DSRIC_0  (0x0u << 17) /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_DSRIC_1  (0x1u << 17) /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_DCDIC_Pos  18           /**< \brief (US_CSR_SPI_SLAVE) Data Carrier Detect Input Change Flag */
#define US_CSR_SPI_SLAVE_DCDIC      (0x1u << US_CSR_SPI_SLAVE_DCDIC_Pos)
#define   US_CSR_SPI_SLAVE_DCDIC_0  (0x0u << 18) /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_DCDIC_1  (0x1u << 18) /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_CTSIC_Pos  19           /**< \brief (US_CSR_SPI_SLAVE) Clear to Send Input Change Flag */
#define US_CSR_SPI_SLAVE_CTSIC      (0x1u << US_CSR_SPI_SLAVE_CTSIC_Pos)
#define   US_CSR_SPI_SLAVE_CTSIC_0  (0x0u << 19) /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_CTSIC_1  (0x1u << 19) /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_RI_Pos     20           /**< \brief (US_CSR_SPI_SLAVE) Image of RI Input */
#define US_CSR_SPI_SLAVE_RI         (0x1u << US_CSR_SPI_SLAVE_RI_Pos)
#define   US_CSR_SPI_SLAVE_RI_0     (0x0u << 20) /**< \brief (US_CSR_SPI_SLAVE) RI is at 0 */
#define   US_CSR_SPI_SLAVE_RI_1     (0x1u << 20) /**< \brief (US_CSR_SPI_SLAVE) RI is at 1 */
#define US_CSR_SPI_SLAVE_DSR_Pos    21           /**< \brief (US_CSR_SPI_SLAVE) Image of DSR Input */
#define US_CSR_SPI_SLAVE_DSR        (0x1u << US_CSR_SPI_SLAVE_DSR_Pos)
#define   US_CSR_SPI_SLAVE_DSR_0    (0x0u << 21) /**< \brief (US_CSR_SPI_SLAVE) DSR is at 0 */
#define   US_CSR_SPI_SLAVE_DSR_1    (0x1u << 21) /**< \brief (US_CSR_SPI_SLAVE) DSR is at 1 */
#define US_CSR_SPI_SLAVE_DCD_Pos    22           /**< \brief (US_CSR_SPI_SLAVE) Image of DCD Input */
#define US_CSR_SPI_SLAVE_DCD        (0x1u << US_CSR_SPI_SLAVE_DCD_Pos)
#define   US_CSR_SPI_SLAVE_DCD_0    (0x0u << 22) /**< \brief (US_CSR_SPI_SLAVE) DCD is at 0 */
#define   US_CSR_SPI_SLAVE_DCD_1    (0x1u << 22) /**< \brief (US_CSR_SPI_SLAVE) DCD is at 1 */
#define US_CSR_SPI_SLAVE_CTS_Pos    23           /**< \brief (US_CSR_SPI_SLAVE) Image of CTS Input */
#define US_CSR_SPI_SLAVE_CTS        (0x1u << US_CSR_SPI_SLAVE_CTS_Pos)
#define   US_CSR_SPI_SLAVE_CTS_0    (0x0u << 23) /**< \brief (US_CSR_SPI_SLAVE) CTS is at 0 */
#define   US_CSR_SPI_SLAVE_CTS_1    (0x1u << 23) /**< \brief (US_CSR_SPI_SLAVE) CTS is at 1 */
#define US_CSR_SPI_SLAVE_MASK       0x00FF3FFFu  /**< \brief (US_CSR_SPI_SLAVE) MASK Register */

