aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
/* -------- US_RHR : (USART Offset: 0x18) (R/  32) Receiver Holding Register -------- */
#define US_RHR_OFFSET               0x18         /**< \brief (US_RHR offset) Receiver Holding Register */
#define US_RHR_RESETVALUE           0x00000000   /**< \brief (US_RHR reset_value) Receiver Holding Register */

#define US_RHR_RXCHR_Pos            0            /**< \brief (US_RHR) Received Character */
#define US_RHR_RXCHR_Msk            (0x1FFu << US_RHR_RXCHR_Pos)
#define US_RHR_RXCHR(value)         ((US_RHR_RXCHR_Msk & ((value) << US_RHR_RXCHR_Pos)))
#define US_RHR_RXSYNH_Pos           15           /**< \brief (US_RHR) Received Sync */
#define US_RHR_RXSYNH               (0x1u << US_RHR_RXSYNH_Pos)
#define   US_RHR_RXSYNH_0           (0x0u << 15) /**< \brief (US_RHR) Last character received is a Data */
#define   US_RHR_RXSYNH_1           (0x1u << 15) /**< \brief (US_RHR) Last character received is a Command */
#define US_RHR_MASK                 0x000081FFu  /**< \brief (US_RHR) MASK Register */

/* -------- US_THR : (USART Offset: 0x1C) ( /W 32) Transmitter Holding Register -------- */
#define US_THR_OFFSET               0x1C         /**< \brief (US_THR offset) Transmitter Holding Register */
#define US_THR_RESETVALUE           0x00000000   /**< \brief (US_THR reset_value) Transmitter Holding Register */

#define US_THR_TXCHR_Pos            0            /**< \brief (US_THR) Character to be Transmitted */
#define US_THR_TXCHR_Msk            (0x1FFu << US_THR_TXCHR_Pos)
#define US_THR_TXCHR(value)         ((US_THR_TXCHR_Msk & ((value) << US_THR_TXCHR_Pos)))
#define US_THR_TXSYNH_Pos           15           /**< \brief (US_THR) Sync Field to be transmitted */
#define US_THR_TXSYNH               (0x1u << US_THR_TXSYNH_Pos)
#define   US_THR_TXSYNH_0           (0x0u << 15) /**< \brief (US_THR) The next character sent is encoded as a data. Start Frame Delimiter is DATA SYNC */
#define   US_THR_TXSYNH_1           (0x1u << 15) /**< \brief (US_THR) The next character sent is encoded as a command. Start Frame Delimiter is COMMAND SYNC */
#define US_THR_MASK                 0x000081FFu  /**< \brief (US_THR) MASK Register */

/* -------- US_BRGR : (USART Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */
#define US_BRGR_OFFSET              0x20         /**< \brief (US_BRGR offset) Baud Rate Generator Register */
#define US_BRGR_RESETVALUE          0x00000000   /**< \brief (US_BRGR reset_value) Baud Rate Generator Register */

#define US_BRGR_CD_Pos              0            /**< \brief (US_BRGR) Clock Divisor */
#define US_BRGR_CD_Msk              (0xFFFFu << US_BRGR_CD_Pos)
#define US_BRGR_CD(value)           ((US_BRGR_CD_Msk & ((value) << US_BRGR_CD_Pos)))
#define   US_BRGR_CD_DISABLE        (0x0u <<  0) /**< \brief (US_BRGR) Disables the clock */
#define   US_BRGR_CD_BYPASS         (0x1u <<  0) /**< \brief (US_BRGR) Clock Divisor Bypass */
#define   US_BRGR_CD_2              (0x2u <<  0) /**< \brief (US_BRGR) Baud Rate (Asynchronous Mode) = Selected Clock/(16 x CD) or (8 x CD); Baud Rate (Synchronous Mode) = Selected Clock/CD; */
#define US_BRGR_FP_Pos              16           /**< \brief (US_BRGR) Fractional Part */
#define US_BRGR_FP_Msk              (0x7u << US_BRGR_FP_Pos)
#define US_BRGR_FP(value)           ((US_BRGR_FP_Msk & ((value) << US_BRGR_FP_Pos)))
#define   US_BRGR_FP_0              (0x0u << 16) /**< \brief (US_BRGR) Fractional divider is disabled */
#define US_BRGR_MASK                0x0007FFFFu  /**< \brief (US_BRGR) MASK Register */

/* -------- US_RTOR : (USART Offset: 0x24) (R/W 32) Receiver Time-out Register -------- */
#define US_RTOR_OFFSET              0x24         /**< \brief (US_RTOR offset) Receiver Time-out Register */
#define US_RTOR_RESETVALUE          0x00000000   /**< \brief (US_RTOR reset_value) Receiver Time-out Register */

#define US_RTOR_TO_Pos              0            /**< \brief (US_RTOR) Time-out Value */
#define US_RTOR_TO_Msk              (0x1FFFFu << US_RTOR_TO_Pos)
#define US_RTOR_TO(value)           ((US_RTOR_TO_Msk & ((value) << US_RTOR_TO_Pos)))
#define   US_RTOR_TO_DISABLE        (0x0u <<  0) /**< \brief (US_RTOR) Disables the RX Time-out function */
#define US_RTOR_MASK                0x0001FFFFu  /**< \brief (US_RTOR) MASK Register */

/* -------- US_TTGR : (USART Offset: 0x28) (R/W 32) Transmitter Timeguard Register -------- */
#define US_TTGR_OFFSET              0x28         /**< \brief (US_TTGR offset) Transmitter Timeguard Register */
#define US_TTGR_RESETVALUE          0x00000000   /**< \brief (US_TTGR reset_value) Transmitter Timeguard Register */

#define US_TTGR_TG_Pos              0            /**< \brief (US_TTGR) Timeguard Value */
#define US_TTGR_TG_Msk              (0xFFu << US_TTGR_TG_Pos)
#define US_TTGR_TG(value)           ((US_TTGR_TG_Msk & ((value) << US_TTGR_TG_Pos)))
#define   US_TTGR_TG_DISABLE        (0x0u <<  0) /**< \brief (US_TTGR) Disables the TX Timeguard function. */
#define US_TTGR_MASK                0x000000FFu  /**< \brief (US_TTGR) MASK Register */

/* -------- US_FIDI : (USART Offset: 0x40) (R/W 32) FI DI Ratio Register -------- */
#define US_FIDI_OFFSET              0x40         /**< \brief (US_FIDI offset) FI DI Ratio Register */
#define US_FIDI_RESETVALUE          0x00000174   /**< \brief (US_FIDI reset_value) FI DI Ratio Register */

#define US_FIDI_FI_DI_RATIO_Pos     0            /**< \brief (US_FIDI) FI Over DI Ratio Value */
#define US_FIDI_FI_DI_RATIO_Msk     (0x7FFu << US_FIDI_FI_DI_RATIO_Pos)
#define US_FIDI_FI_DI_RATIO(value)  ((US_FIDI_FI_DI_RATIO_Msk & ((value) << US_FIDI_FI_DI_RATIO_Pos)))
#define   US_FIDI_FI_DI_RATIO_DISABLE (0x0u <<  0) /**< \brief (US_FIDI) Baud Rate = 0 */
#define US_FIDI_MASK                0x000007FFu  /**< \brief (US_FIDI) MASK Register */

/* -------- US_NER : (USART Offset: 0x44) (R/  32) Number of Errors Register -------- */
#define US_NER_OFFSET               0x44         /**< \brief (US_NER offset) Number of Errors Register */
#define US_NER_RESETVALUE           0x00000000   /**< \brief (US_NER reset_value) Number of Errors Register */

#define US_NER_NB_ERRORS_Pos        0            /**< \brief (US_NER) Error number during ISO7816 transfers */
#define US_NER_NB_ERRORS_Msk        (0xFFu << US_NER_NB_ERRORS_Pos)
#define US_NER_NB_ERRORS(value)     ((US_NER_NB_ERRORS_Msk & ((value) << US_NER_NB_ERRORS_Pos)))
#define US_NER_MASK                 0x000000FFu  /**< \brief (US_NER) MASK Register */

