aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
/* -------- US_IFR : (USART Offset: 0x4C) (R/W 32) IrDA Filter Register -------- */
#define US_IFR_OFFSET               0x4C         /**< \brief (US_IFR offset) IrDA Filter Register */
#define US_IFR_RESETVALUE           0x00000000   /**< \brief (US_IFR reset_value) IrDA Filter Register */

#define US_IFR_IRDA_FILTER_Pos      0            /**< \brief (US_IFR) Irda filter */
#define US_IFR_IRDA_FILTER_Msk      (0xFFu << US_IFR_IRDA_FILTER_Pos)
#define US_IFR_IRDA_FILTER(value)   ((US_IFR_IRDA_FILTER_Msk & ((value) << US_IFR_IRDA_FILTER_Pos)))
#define US_IFR_MASK                 0x000000FFu  /**< \brief (US_IFR) MASK Register */

/* -------- US_MAN : (USART Offset: 0x50) (R/W 32) Manchester Configuration Register -------- */
#define US_MAN_OFFSET               0x50         /**< \brief (US_MAN offset) Manchester Configuration Register */
#define US_MAN_RESETVALUE           0x30011004   /**< \brief (US_MAN reset_value) Manchester Configuration Register */

#define US_MAN_TX_PL_Pos            0            /**< \brief (US_MAN) Transmitter Preamble Length */
#define US_MAN_TX_PL_Msk            (0xFu << US_MAN_TX_PL_Pos)
#define US_MAN_TX_PL(value)         ((US_MAN_TX_PL_Msk & ((value) << US_MAN_TX_PL_Pos)))
#define   US_MAN_TX_PL_0            (0x0u <<  0) /**< \brief (US_MAN) The Transmitter Preamble pattern generation is disabled */
#define US_MAN_TX_PP_Pos            8            /**< \brief (US_MAN) Transmitter Preamble Pattern */
#define US_MAN_TX_PP_Msk            (0x3u << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP(value)         ((US_MAN_TX_PP_Msk & ((value) << US_MAN_TX_PP_Pos)))
#define   US_MAN_TX_PP_0            (0x0u <<  8) /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_TX_PP_1            (0x1u <<  8) /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_TX_PP_2            (0x2u <<  8) /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_TX_PP_3            (0x3u <<  8) /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_TX_MPOL_Pos          12           /**< \brief (US_MAN) Transmitter Manchester Polarity */
#define US_MAN_TX_MPOL              (0x1u << US_MAN_TX_MPOL_Pos)
#define   US_MAN_TX_MPOL_0          (0x0u << 12) /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_TX_MPOL_1          (0x1u << 12) /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_RX_PL_Pos            16           /**< \brief (US_MAN) Receiver Preamble Length */
#define US_MAN_RX_PL_Msk            (0xFu << US_MAN_RX_PL_Pos)
#define US_MAN_RX_PL(value)         ((US_MAN_RX_PL_Msk & ((value) << US_MAN_RX_PL_Pos)))
#define   US_MAN_RX_PL_0            (0x0u << 16) /**< \brief (US_MAN) The receiver preamble pattern detection is disabled */
#define US_MAN_RX_PP_Pos            24           /**< \brief (US_MAN) Receiver Preamble Pattern detected */
#define US_MAN_RX_PP_Msk            (0x3u << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP(value)         ((US_MAN_RX_PP_Msk & ((value) << US_MAN_RX_PP_Pos)))
#define   US_MAN_RX_PP_0            (0x0u << 24) /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_RX_PP_1            (0x1u << 24) /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_RX_PP_2            (0x2u << 24) /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_RX_PP_3            (0x3u << 24) /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_RX_MPOL_Pos          28           /**< \brief (US_MAN) Receiver Manchester Polarity */
#define US_MAN_RX_MPOL              (0x1u << US_MAN_RX_MPOL_Pos)
#define   US_MAN_RX_MPOL_0          (0x0u << 28) /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_RX_MPOL_1          (0x1u << 28) /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_DRIFT_Pos            30           /**< \brief (US_MAN) Drift compensation */
#define US_MAN_DRIFT                (0x1u << US_MAN_DRIFT_Pos)
#define   US_MAN_DRIFT_0            (0x0u << 30) /**< \brief (US_MAN) The USART can not recover from an important clock drift */
#define   US_MAN_DRIFT_1            (0x1u << 30) /**< \brief (US_MAN) The USART can recover from clock drift. The 16X clock mode must be enabled */
#define US_MAN_MASK                 0x530F130Fu  /**< \brief (US_MAN) MASK Register */

/* -------- US_LINMR : (USART Offset: 0x54) (R/W 32) LIN Mode Register -------- */
#define US_LINMR_OFFSET             0x54         /**< \brief (US_LINMR offset) LIN Mode Register */
#define US_LINMR_RESETVALUE         0x00000000   /**< \brief (US_LINMR reset_value) LIN Mode Register */

#define US_LINMR_NACT_Pos           0            /**< \brief (US_LINMR) LIN Node Action */
#define US_LINMR_NACT_Msk           (0x3u << US_LINMR_NACT_Pos)
#define US_LINMR_NACT(value)        ((US_LINMR_NACT_Msk & ((value) << US_LINMR_NACT_Pos)))
#define   US_LINMR_NACT_PUBLISH     (0x0u <<  0) /**< \brief (US_LINMR) The LIN Controller transmits the response */
#define   US_LINMR_NACT_SUBSCRIBE   (0x1u <<  0) /**< \brief (US_LINMR) The LIN Controller receives the response */
#define   US_LINMR_NACT_IGNORE      (0x2u <<  0) /**< \brief (US_LINMR) The LIN Controller doesn't transmit and doesn't receive the response */
#define US_LINMR_PARDIS_Pos         2            /**< \brief (US_LINMR) Parity Disable */
#define US_LINMR_PARDIS             (0x1u << US_LINMR_PARDIS_Pos)
#define US_LINMR_CHKDIS_Pos         3            /**< \brief (US_LINMR) Checksum Disable */
#define US_LINMR_CHKDIS             (0x1u << US_LINMR_CHKDIS_Pos)
#define US_LINMR_CHKTYP_Pos         4            /**< \brief (US_LINMR) Checksum Type */
#define US_LINMR_CHKTYP             (0x1u << US_LINMR_CHKTYP_Pos)
#define US_LINMR_DLM_Pos            5            /**< \brief (US_LINMR) Data Length Mode */
#define US_LINMR_DLM                (0x1u << US_LINMR_DLM_Pos)
#define US_LINMR_FSDIS_Pos          6            /**< \brief (US_LINMR) Frame Slot Mode Disable */
#define US_LINMR_FSDIS              (0x1u << US_LINMR_FSDIS_Pos)
#define US_LINMR_WKUPTYP_Pos        7            /**< \brief (US_LINMR) Wakeup Signal Type */
#define US_LINMR_WKUPTYP            (0x1u << US_LINMR_WKUPTYP_Pos)
#define US_LINMR_DLC_Pos            8            /**< \brief (US_LINMR) Data Length Control */
#define US_LINMR_DLC_Msk            (0xFFu << US_LINMR_DLC_Pos)
#define US_LINMR_DLC(value)         ((US_LINMR_DLC_Msk & ((value) << US_LINMR_DLC_Pos)))
#define US_LINMR_PDCM_Pos           16           /**< \brief (US_LINMR) PDC Mode */
#define US_LINMR_PDCM               (0x1u << US_LINMR_PDCM_Pos)
#define US_LINMR_SYNCDIS_Pos        17           /**< \brief (US_LINMR) Synchronization Disable */
#define US_LINMR_SYNCDIS            (0x1u << US_LINMR_SYNCDIS_Pos)
#define US_LINMR_MASK               0x0003FFFFu  /**< \brief (US_LINMR) MASK Register */

/* -------- US_LINIR : (USART Offset: 0x58) (R/W 32) LIN Identifier Register -------- */
#define US_LINIR_OFFSET             0x58         /**< \brief (US_LINIR offset) LIN Identifier Register */
#define US_LINIR_RESETVALUE         0x00000000   /**< \brief (US_LINIR reset_value) LIN Identifier Register */

#define US_LINIR_IDCHR_Pos          0            /**< \brief (US_LINIR) Identifier Character */
#define US_LINIR_IDCHR_Msk          (0xFFu << US_LINIR_IDCHR_Pos)
#define US_LINIR_IDCHR(value)       ((US_LINIR_IDCHR_Msk & ((value) << US_LINIR_IDCHR_Pos)))
#define US_LINIR_MASK               0x000000FFu  /**< \brief (US_LINIR) MASK Register */

/* -------- US_LINBRR : (USART Offset: 0x5C) (R/  32) LIN Baud Rate Register -------- */
#define US_LINBRR_OFFSET            0x5C         /**< \brief (US_LINBRR offset) LIN Baud Rate Register */
#define US_LINBRR_RESETVALUE        0x00000000   /**< \brief (US_LINBRR reset_value) LIN Baud Rate Register */

