aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_usart.h
#define US_LINBRR_LINCD_Pos         0            /**< \brief (US_LINBRR) Clock Divider after Synchronization */
#define US_LINBRR_LINCD_Msk         (0xFFFFu << US_LINBRR_LINCD_Pos)
#define US_LINBRR_LINCD(value)      ((US_LINBRR_LINCD_Msk & ((value) << US_LINBRR_LINCD_Pos)))
#define US_LINBRR_LINFP_Pos         16           /**< \brief (US_LINBRR) Fractional Part after Synchronization */
#define US_LINBRR_LINFP_Msk         (0x7u << US_LINBRR_LINFP_Pos)
#define US_LINBRR_LINFP(value)      ((US_LINBRR_LINFP_Msk & ((value) << US_LINBRR_LINFP_Pos)))
#define US_LINBRR_MASK              0x0007FFFFu  /**< \brief (US_LINBRR) MASK Register */

/* -------- US_WPMR : (USART Offset: 0xE4) (R/W 32) Write Protect Mode Register -------- */
#define US_WPMR_OFFSET              0xE4         /**< \brief (US_WPMR offset) Write Protect Mode Register */
#define US_WPMR_RESETVALUE          0x00000000   /**< \brief (US_WPMR reset_value) Write Protect Mode Register */

#define US_WPMR_WPEN_Pos            0            /**< \brief (US_WPMR) Write Protect Enable */
#define US_WPMR_WPEN                (0x1u << US_WPMR_WPEN_Pos)
#define   US_WPMR_WPEN_0            (0x0u <<  0) /**< \brief (US_WPMR) Disables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define   US_WPMR_WPEN_1            (0x1u <<  0) /**< \brief (US_WPMR) Enables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define US_WPMR_WPKEY_Pos           8            /**< \brief (US_WPMR) Write Protect Key */
#define US_WPMR_WPKEY_Msk           (0xFFFFFFu << US_WPMR_WPKEY_Pos)
#define US_WPMR_WPKEY(value)        ((US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos)))
#define US_WPMR_MASK                0xFFFFFF01u  /**< \brief (US_WPMR) MASK Register */

/* -------- US_WPSR : (USART Offset: 0xE8) (R/  32) Write Protect Status Register -------- */
#define US_WPSR_OFFSET              0xE8         /**< \brief (US_WPSR offset) Write Protect Status Register */
#define US_WPSR_RESETVALUE          0x00000000   /**< \brief (US_WPSR reset_value) Write Protect Status Register */

#define US_WPSR_WPV_Pos             0            /**< \brief (US_WPSR) Write Protect Violation Status */
#define US_WPSR_WPV                 (0x1u << US_WPSR_WPV_Pos)
#define   US_WPSR_WPV_0             (0x0u <<  0) /**< \brief (US_WPSR) No Write Protect Violation has occurred since the last read of the WPSR register */
#define   US_WPSR_WPV_1             (0x1u <<  0) /**< \brief (US_WPSR) A Write Protect Violation has occurred since the last read of the WPSR register. If this violation is an unauthorized attempt to write a protected register, the associated violation is reported into field WPVSRC */
#define US_WPSR_WPVSRC_Pos          8            /**< \brief (US_WPSR) Write Protect Violation Source */
#define US_WPSR_WPVSRC_Msk          (0xFFFFu << US_WPSR_WPVSRC_Pos)
#define US_WPSR_WPVSRC(value)       ((US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos)))
#define US_WPSR_MASK                0x00FFFF01u  /**< \brief (US_WPSR) MASK Register */

/* -------- US_VERSION : (USART Offset: 0xFC) (R/  32) Version Register -------- */
#define US_VERSION_OFFSET           0xFC         /**< \brief (US_VERSION offset) Version Register */
#define US_VERSION_RESETVALUE       0x00000602   /**< \brief (US_VERSION reset_value) Version Register */

#define US_VERSION_VERSION_Pos      0            /**< \brief (US_VERSION) Version */
#define US_VERSION_VERSION_Msk      (0xFFFu << US_VERSION_VERSION_Pos)
#define US_VERSION_VERSION(value)   ((US_VERSION_VERSION_Msk & ((value) << US_VERSION_VERSION_Pos)))
#define US_VERSION_MFN_Pos          16           /**< \brief (US_VERSION) MFN */
#define US_VERSION_MFN_Msk          (0xFu << US_VERSION_MFN_Pos)
#define US_VERSION_MFN(value)       ((US_VERSION_MFN_Msk & ((value) << US_VERSION_MFN_Pos)))
#define US_VERSION_MASK             0x000F0FFFu  /**< \brief (US_VERSION) MASK Register */

/** \brief USART hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  WoReg   US_CR;              /**< \brief (USART Offset: 0x00) Control Register */
  RwReg   US_MR;              /**< \brief (USART Offset: 0x04) Mode Register */
  WoReg   US_IER;             /**< \brief (USART Offset: 0x08) Interrupt Enable Register */
  WoReg   US_IDR;             /**< \brief (USART Offset: 0x0C) Interrupt Disable Register */
  RoReg   US_IMR;             /**< \brief (USART Offset: 0x10) Interrupt Mask Register */
  RoReg   US_CSR;             /**< \brief (USART Offset: 0x14) Channel Status Register */
  RoReg   US_RHR;             /**< \brief (USART Offset: 0x18) Receiver Holding Register */
  WoReg   US_THR;             /**< \brief (USART Offset: 0x1C) Transmitter Holding Register */
  RwReg   US_BRGR;            /**< \brief (USART Offset: 0x20) Baud Rate Generator Register */
  RwReg   US_RTOR;            /**< \brief (USART Offset: 0x24) Receiver Time-out Register */
  RwReg   US_TTGR;            /**< \brief (USART Offset: 0x28) Transmitter Timeguard Register */
  RoReg8  Reserved1[0x14];
  RwReg   US_FIDI;            /**< \brief (USART Offset: 0x40) FI DI Ratio Register */
  RoReg   US_NER;             /**< \brief (USART Offset: 0x44) Number of Errors Register */
  RoReg8  Reserved2[0x4];
  RwReg   US_IFR;             /**< \brief (USART Offset: 0x4C) IrDA Filter Register */
  RwReg   US_MAN;             /**< \brief (USART Offset: 0x50) Manchester Configuration Register */
  RwReg   US_LINMR;           /**< \brief (USART Offset: 0x54) LIN Mode Register */
  RwReg   US_LINIR;           /**< \brief (USART Offset: 0x58) LIN Identifier Register */
  RoReg   US_LINBRR;          /**< \brief (USART Offset: 0x5C) LIN Baud Rate Register */
  RoReg8  Reserved3[0x84];
  RwReg   US_WPMR;            /**< \brief (USART Offset: 0xE4) Write Protect Mode Register */
  RoReg   US_WPSR;            /**< \brief (USART Offset: 0xE8) Write Protect Status Register */
  RoReg8  Reserved4[0x10];
  RoReg   US_VERSION;         /**< \brief (USART Offset: 0xFC) Version Register */
} Usart;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_USART_COMPONENT_ */
